["@KenyaPower_Care https://t.co/ko69gmLJo2", "Hi, please assist power outage in Nakuru, Manyani area, Block 14/644. Prepaid CIU no. 1309558843 @KenyaPower_Care", "@KenyaPower_Care 14234768712, phone number 0729063258", "@KenyaPower_Care 2/2: How come a friend got token 31.1 units for 400/- and my 1000/- got only 17 units? In the same week?", "@KenyaPower_Care  bought tokens through Mpesa. No code has been received yet. 30 min later. What gives? Mtr number 14252799961", "@KenyaPower_Care its a new house. Meter no. 37165047210  7. My stall is one of the rooms. Trail 3 units are over. 0729170172", "@KenyaPower_Care Kindly check for me the balance for this account 2009740-01, I am about to do payment.", "@KenyaPower_Care meter number14234768712, phone number 0729063258", "When @KenyaPower_Care decides to spoil my day off. Buru Phase 5 jo, notorious for power loss", "@kenyapower_care \ni have just paid some minutes ago tokens worth 450 and u have given me only 1:7 units y mit no 14252224549", "@KenyaPower_Care Mtr No : 14253475470 Token : 32203791942838327971 Date :2016-05-02 17:32:14 +0300 Amount Kshs : 1000 Units : 17.9\nHow.. 1/2", "@KenyaPower_Care i checked still not listed", "@KenyaPower_Care its at Dagoretti, ruthimitu tithonia mango court and my number is 0724032400,", "Lakini @KenyaPower_Care mna madharau bana, I have been following you up for a simple task smh.", "Hey @KenyaPower_Care @KenyaPower No lights in Buruburu,Whats up?", "@KenyaPower_Care Hi outage in Jamhuri estate. Scheduled?04216306623", "@KenyaPower_Care no power in Tassia estate Amani courts", "@KenyaPower_Care   Trans ID: 1605071618670 account 14252709663 OJ, ruiru.", "Thanks @KenyaPower_Care @Zicosoulworld @Georgekimemia3 for being top engaged community members this week :) &gt;&gt; https://t.co/dGO2LHxvXy", "@KenyaPower_Care do fixed charges accrue ? e.g. if i buy tokens that take me 3 months without exhausting them ?", "@KenyaPower_Care Mtr No : 22119915738", "@KenyaPower_Care Kindly let me know the account number that corresponds to the following meter number 60981588", "@KenyaPower_Care Whatever happened to 2503485-01. This transformer has been out since last year. Honestly, there's a widow who relies on it.", "@KenyaPower_Care umoja 1,I bought a token but mistakenly wrote wrong ac no of 01450635537 instead of 01450635527 &amp; the money was deducted", "Meter number 14107253644 and the entire forest lane has power outage @KenyaPower_Care @KenyaPower please assist🙏", "@KenyaPower_Care okey guys is this the kind of service we pay for!?not even a response!!good job.reply wen u fee like acc no 2724789-01", "@KenyaPower_Care power out at woodley ngong rd from 10:30am. A/c 01450214810. Sort it out please", "@KenyaPower_Care what's happening", "@KenyaPower_Care Seriously! It's been 72hrs and counting! No response!", "@KenyaPower_Care my lights went out midshower &amp; I am not in a scheduled interruption area. Jamuhuri/Woodley area.", "@kenyapower_care hey kplc!!", "@KenyaPower_Care @Ma3Route @citizentvkenya Power lines are hanging dangerously and we need help ASAP", "@KenyaPower_Care help get tokens. KE530BICEJ metre no 14235434652", "@KenyaPower_Care @dailynation @KenyaRedCross Reports have been sent to your desk and we are yet to receive help. There are flats around", "@KenyaPower_Care @KenyaPower", "@KenyaPower_Care the meter no:14140524373.Your technicians were here yesternight &amp; they might have switched it off", "@kenyapower_care please sort it out. Its urgent!", "@kenyapower_care URGENT!! HELLLP..", "@KenyaPower_Care I just got the confirmation from KP all is ok now thanks", "@KenyaPower_Care @KenyaPower your service on 95551 is not replying my query.", "@KenyaPower_Care Hi, I just bought pre-pay units for the wrong meter number. Is it possible to reverse the transaction?", "@kenyapower_care hey. Just topped up and cant get tokens. Help. KE530BICEJ metrer no. 14235434652", "@KenyaPower_Care a cow has just been electrocuted in South C, Amboseli area due to wires hanging precariously. Help!", "@KenyaPower_Care trying to pay not going through, please assist", "@KenyaPower_Care my meter number is 14252638219 I just bought    tokens and still?", "@KenyaPower_Care Act promptly on this matter.Be just", "@KenyaPower_Care no electricity from morning; Shanzu water it's like a trend please check don't ignore", "@KenyaPower_Care haiya. We've had a blackout since 8.30. A/c number 358993601", "@KenyaPower_Care 106938-02 a/c no\n0713337051 mbl hey no lights in area\nsurrounding kirangari high school gikuni\nregion", "@KenyaPower_Care ref: 2676304 Who can I escalate this to coz clearly I see zero progress a week later???!!!", "@KenyaPower_Care meter number 14234936772", "@KenyaPower_Care we are waiting guys kiganjo thika acc no.2724789-01", "@KenyaPower_Care Trans ID: 1605071973378 You have sent 500Ksh to My Power in reference to account 14104588836. Is there a delay in token", "@KenyaPower_Care 374 shillings 3.6 units for meter number 14234936772,so is a unit 100 shillings?This is ridiculous!Be just and rectify this", "@KenyaPower_Care @kenyapower Dr. Ben Chumo, what's the story today?? I've had no power for 6 days.. Any explanation? @ConsumersKenya", "@KenyaPower_Care 3rd message please we nees to thw problem and wen to expect the power back kiganjo thika acc no.2724789-01", "@KenyaPower_Care \rWe have a problem at the Tx. Wakulima dairy Mùkùrwe-ini", "@KenyaPower_Care 374 shillings 3.6 units for meter number 14234936772.So is a unit 100 shillings????", "@KenyaPower_Care please solve the problem and inform us wen to get the power back here at kiganjo thika acc no.2724789-01", "@KenyaPower_Care I've been complaining since Monday about no lights at my place and no one has come to fix it reference number 2680043", "@KenyaPower_Care Kindly check for me the balance of this account no. 2009740-01, This is my second tweet and still no response.", "@AbalaKinyua Hi, we have sent you the @KenyaPower_Care token ID via DM.", "@KenyaPower_Care am really tired of complaining everyday cnt you please do something really!!?kiganjo thika acc no.2724789-01", "@KenyaPower_Care @LarryMadowo kids pass through here, everyday on there way to school, not to mention the weeklong blackout", "@kenyaPower_Care thanx light are back end of 4 days blackout but we got a dim nd full light situation at meter no 9886301 please help", "@KenyaPower_Care culture of waiting for disaster to strike then act, 3rd day nothing done, road to Kanga High sch https://t.co/xCfKjC7KsH", "@KenyaPower_Care Hi. No power for over 2 hours on 3684859-01. Yet we are scheduled for tomorrow, not today.", "@KenyaPower_Care, pls rectify faulty feeder lines near Philipa plaza after KINCAR in Utawala.  Over 30 houses no power last one week", "@kenyapower_care @nyeriyetu Transformer is at Muriatine( a village in Uruku sub-location). Tel/Mob: 0726726796.", "@KenyaPower_Care check DM", "@KenyaPower_Care please bring our power back. Jamuhuri II account no 37151108539", "@KenyaPower_Care excuse me??? We see you online at least reply", "@KenyaPower_Care thanks for the update. I shall wait and see", "@KenyaPower_Care I managed to speak to someone on phone. Account# is 14106738819", "\"@KenyaPower_Care: Is that maintaining transformers in the slums is more expensive than other places, in darkness since November 2015", "@KenyaPower_Care i have purchased tocken via @KeEquityBank line no response 1 hr later. A/C 14228628492  No. 0764663921", "@KenyaPower_Care no one came to read my meter in April &amp; yet you've sent a bill,my current reading is 024009 and previous was 023859", "@KenyaPower_Care hi, is there scheduled power interruption in Jamhuri today? Sasa sisi watu wa welding tutatoa mboga wapi Leo?", "@KenyaPower_Care  ^ Caro @WarishEssy", "@KenyaPower_Care No power in Thome. A/c 2439682-01", "@KenyaPower_Care  thanks, I got power back.", "@KenyaPower_Care @kenyapower ^BT, Good morning? did you get through to your team? It's now 6 days without power", "@KenyaPower_Care please assist. a hazard sign is showing with 7.9 units remaining and prepay Metre not working. red light keeps blinking .", "@SafaricomLtd @KenyaPower_Care isn't responsive. Calls &amp; tweets are ignored. Buying tokens via Mpesa is the only means failing. I used KCB.", "@KenyaPower_Care I still don't understand ksh 400 buying 7 units only if a unit cost 8.96.@ConsumersKenya", "@KenyaPower @KenyaPower_Care acc number 5072814-01 no lights since yesterday and surrounding areas pls!", "@kenyapower_care Eldoret simat.0728893507 .installed in nov 2015 this was a new connection.no old ac.", "@KenyaPower_Care stand up to your word", "@KenyaPower_Care not yet do u have a time frame of when they are going to be repaired?", "@KenyaPower_Care Our power in Hurlingham Estate has been off since 10:30 am today. Prepaid Acc no 14107463698", "@KenyaPower_Care I have sent money through MPESA &gt;&gt; KE56OB0PFG\nThere is a delay. Help", "@KenyaPower_Care @KenyaPower_Care jogoo rd near KCB/Uchumi there's no power again today. What's the issue this time, poles?", "@KenyaPower_Care When can I get power back??? meter no: 2805551-01 kileleshwa.", "Ref. no. 2684469 has been sorted @KenyaPower_Care", "@SafaricomLtd Kindly reverse the transaction KE41027W79 to @KenyaPower_Care now that I haven't gotten the units I payed for since Yesterday.", "@KenyaPower_Care no lights in kimathi metre no. 22119921868", "@KenyaPower_Care electrical wires hanging dangerously in Nyeri along Ngangarithi-Kandara rd,tragedy in waiting https://t.co/JZZZ9elXqO", "@kenyapower_care 0728893507", "@KenyaPower_Care We have been missing power for almost 24hrs. No response from KPLC. Acct.37155953302", "@KenyaPower_Care confirmed", "@KenyaPower_Care  customer on meter no. 717209-01. meter readers sit under a tree 4 readings. 3 mnths is 49970  actual 48341 bill on 49970", "@KenyaPower_Care I thought I gave you phone and account number..I have not received any assistance and I still in darkness", "@KenyaPower_Care https://t.co/fPmzgWFvHC", "@KenyaPower_Care  no power along wood avenue.  When should we expect it back?", "@KenyaPower_Care ongata rongai...the whole of ongata mall area..the exact place is kins archade bulding...pple suffering..its 5th day!!!", "@KenyaPower_Care thank you", "RT @SheilaCather: @KenyaPower_Care when should we expect your digging goons to come through??? Day 4 with no power,got food that's gonna sp…", "@KenyaPower_Care hello! Nilitop up my meter no.14235229441. with 500/- and no confirmaion returned why?", "@KenyaPower_Care Thank you", "@KenyaPower_Care South Coast, Diani - Galu Beach, Sunset road. acc: 4297304-01 phone +254701080752 POWER WENT DOWN, PLEASE FIX!", "@KenyaPower_Care 2814274-01", "@KenyaPower_Care hey how do i activate my account please help", "@UKenyatta Am currently sitted idle bcoz @KenyaPower_Care decided not to repair the affected line in Githurai 45..order them please", "@KenyaPower_Care thank you I looked in the notice dated today", "@KenyaPower_Care i pay my bill(2513206) jana through Family bank,why iam i seeing some balance again?", "@KenyaPower_Care Hello I paid my bill via mpesa on 22/4/16 but the acc was not credited coz it's in arrears since March. Ac 4562153-01. Help", "@KenyaPower_Care .Meter No: 14252021051, Token: 55726814650102358669, failed please help", "@KenyaPower_Care done. Please check your inbox", "@KenyaPower_Care so now whats the problem in nakuru East that there is no power", "@KenyaPower_Care DM", "@KenyaPower_Care Am sick and tired of your bad service!! When can I get power back??? meter no: 2805551-01 kileleshwa.", "@KenyaPower_Care  Morning we have  power outage at Hurlingham area, Jabavu rd. Please check into it", "@KenyaPower_Care y'all better act right now...its freaking 2016,14 years to your freaking 2030 vision ..", "@KenyaPower_Care I bought tokens yesterday via mpesa I have not received the tokens up to today. Your helplines have been busy since then..", "RT @SheilaCather: @KenyaPower_Care when should we expect your digging goons to come through??? Day 4 with no power,got food that's gonna sp…", "@kenyaPower_care its day four of blackout no help, ongata rongai, nafrom area around Thorn Tree school, whole area no lights.", "@KenyaPower_Care flactuating power and a transformer that keeps exploding in dagoretti acc 2004542", "@KenyaPower_Care no power in Karen, what is the problem?", "@KenyaPower_Care I bought tokens yesterday via mpesa,I have not received the tokens up to today", "@kenyapower_care power is off in Karen along St. Hannah's boys...\nwhat is happening???", "@KenyaPower_Care It has become a norm for lights to go off on Thursdays along Dennis Pritt road. This is really affecting business.", "@KenyaPower_Care y'all the most selfish people ever .tsk,we reported the issue to the kiambu offices yesterday, its 10:30am still not here", "@KenyaPower_Care Morning, is there a scheduled maintenance today in Ruaka?? And a fuse blew last night on the By-Pass transformer as well..", "@KenyaPower_Care after pressing 804 the meter still indicates 'failed'", "@KenyaPower_Care Power outage since yesterday from Kanduyi all along to town. Khalaba Ward. Pls send team on the ground.", "@KenyaPower_Care I have given my meter no and confirmed the token, what next? For how long should I stay in darkness?", "Black out at 2279672-01. Kindly assist promptly @KenyaPower_Care", "@KenyaPower_Care I bought tokens worth 174 shillings yester night but I havent received the tokens till now.My meter number is 14234936772", "@KenyaPower_Care Always on the ground yet no power for 2 days and counting on Gichugu Road??", "Hey @KenyaPower_Care no lights on Theta Lane off Lenana road. What's with that?", "@KenyaPower_Care. 3weeks now....yet this pole hangs in the middle of the road... Disaster awaiting to happen https://t.co/unkSAKv5UZ", "@KenyaPower @KenyaPowerAlert @KenyaPower_Care it has taken 24hrs now without power. Can you stop this outages?", "@KenyaPower_Care dm", "@kenyapower_care, been in the dark two days now. Account no. 4043006-01 Kaplenge area, Marakwet. Others have power though.", "@KenyaPower_Care I havent received tokens since yesterday for meter number 14234936772.I sent 174 shillings via my mpesa.Sort this mess", "@KenyaPower_Care when should we expect your digging goons to come through??? Day 4 with no power,got food that's gonna spoil,n water to pump", "@KenyaPower_Care I'm tired of always having to beg for units I've bought via *885# mtr no. 14140757726. Please generate it now.", "@kenyapower_care when u r at it do an email for the  authorization signature for the transformer to be issued...", "@KenyaPower @KenyaPowerAlert @KenyaPower_Care What's happening, since yesterday no power, since when will rectify this? Acc 2452278", "@KenyaPower_Care No power in Kileleshwa area Gichugu road for 2 days and counting.Whats going on? 2474844.", "@KenyaPower_Care  Hehehe u Gys there's no day that Wil pass without me complaining about buru phase 2 having no lights", "@KenyaPower_Care  we need power in Tassia estate we are loosing a lot on business due to power failure almost on a daily basis", "@KenyaPower_Care still waiting for a reply to my query.", "@KenyaPower_Care we have been experiencing fluctuations since yesterday at Dagoretti waithaka area meter no is 14240930090", "@KenyaPower_Care is ua mpesa system working? Paid my bill over a week ago &amp; still no action/response from ua end? Advise please", "@KenyaPower_Care, what is the phone no. of cust. care Marakwet Branch? the line serving my home and neighborhood is faulty. Been in the dark", "@KenyaPower_Care A/C No. 2252459-01, Tombe area, Ikonge, Nyamira. Coordinates: -0.535,35.013\nCell-0724 081 947", "@KenyaPower_Care hi. i paid money to a wrong account. sent all signed documents tuesday. no response as of today.", "@KenyaPower_Care hi I purchased tokens for AC.14251891942 but not yet received.", "@kenyapower_care  blackout for nearly 13hrs now. njoro town. Accno. 3890094", "@KenyaPower_Care hello, we have no electricity at home. I am based in nyamgumi road-kilimani. Thank u for ur assistance", "@kenyapower_care Power supply is nt steady.. Its either dim or off at Hunters. account number Meter No: 04211630167", "@KenyaPower_Care hallo KP i have paid for elec via mpesa but i seem not to get a reply the acc number is 2118914-01.confirm if system is up", "@kenyapower_care Thanks its been sorted.", "@KenyaPower_Care Just wondering three days later this matter number isn't activated!!! How long does it take? Thought it was digital??", "@KenyaPower @KenyaPower_Care No power on Nandi road, Karen since 4pm yesterday. What is going on? Account 3804891", "@KenyaPower_Care no power since 9am today....acc no 01450487622", "@KenyaPower_Care power outage in part of Nara court Old Donholm acc no 01450719586", "@KenyaPower_care paid for tokens last night via airtel money ID 1605071936594 havent received the tokens yet", "@KenyaPower_Care kindly sort us in muthiga kinoo. We haven't had power since 6am", "@KenyaPower_Care we've not had power since 6:00am in muthiga kinoo. Kindly check", "RT @KenyaPower_Care: Athi Ex New Airport is off affecting; Shell Depot, Nation Est, JKA Resort, Mbunge Est, Syokimau, Mlolongo &amp; environs.…", "@KenyaPower_Care no power since 4pm yesterday account 3310558 nbi. No response to my previous message yesterday either. Whats going on?", "@KenyaPower_Care DM please?", "@KenyaPower_Care Confirmed. Thank you.", "@KenyaPower_Care 0722472447,near aplace called bobs at githurai 44 nairobi.", "@kenyapower_care we experience this now almost daily!!!", "@KenyaPower_Care I would like you guys to pay a visit to the site and check out my meter. Who do i contact?", "@KenyaPower_Care am still waiting to know why ksh400 bought me only 7 units @ConsumersKenya .", "@KenyaPower_Care Again no electricity in our plot &amp;few others while there is in neighborhd a/c 22119945883 please fix this once and for all", "@KenyaPower_Care no power in Ruaka. is it being sorted. a/c 37150530485. And this time please reply in time", "@KenyaPower_Care Why is it that there is no power in Kileleshwa near your substation? Your agents aren't picking callsAccount no2453567-01.", "@KenyaPower_Care I've been getting very high bills. They are all estimates. I would like my meter to be read accurately. How do i do that?", "@KenyaPower_Care a/c 3255712 in kinoo there has been no electricity for the last three days and nobody seems bothered....can we get help?", "Where is the token for mtn. 01450493117 transacted thro. Phone no. 0726465936 @KenyaPower_Care", "@KenyaPower_Care reference number: 2685074 account number 3424442-01", "@KenyaPower_Care 87 in the Kinoo area has no power since 7:30pm last night. I'm sure technicians know it has 2 phases. 1 phase is still out", "@KenyaPower_Care hi, can I still use the ref No you gave last week?Same problem has recurred.Emergency numbers not being picked 01450407885", "@KenyaPower_Care hi bought tokens for mtr no. 37152459519 last night but the mtr is not accepting the token number. Assist", "@KenyaPower_Care Morning, is there a scheduled maintenance today in Ruaka?? And a fuse blew last night on the By-Pass transformer as well..", "@KenyaPower_Care you did not get back", "@KenyaPower_Care do u care to respond to our tweets?@ConsumersKenya tell @kenya power to up their game", "@KenyaPower_Care any update??? Or will you tell me that you will follow up with your crew on the ground?? You guys need to wake up and work!", "@KenyaPower_Care mistated my a/c no. While buying tokens via Mpesa. put 35151021187 instead of 37151021187. Reverse 4 me to my right a/c", "@KenyaPower_Care no power on 2265266-01. Kindly attend to it", "Where is the token number for mtn. 01450493117  @KenyaPower_Care", "@kenyapower_care @nyeriyetu We've been in the dark for almost a month. meter no. 60576047, Muriatine Meru.", "@KenyaPowerAlert @KenyaPower_Care I havr no Elec 2847429-01. I dont see our area in the schedule for no power", "@KenyaPower_Care I have bought a token wrth 2000 nd 50  bt the mtr indicates 'failed' once i enter the digits. Mtr no. 14244986783 Pls help", "@KenyaPower_Care Again no lights....what is happening?@buruburu phs 2", "@KenyaPower_Care power outages every now and then here in Shimo La Tewa since yesterday!!", "@KenyaPower_Care Low voltage power in our area since jana night. Kindly check account 2285135 and send your team.", "@KenyaPower_Care waiting", "Hi @KenyaPower_Care . Still no lights since yeaterday. Check DM", "@KenyaPower_Care there is no network on my meter 14244986783, it says 'failed' anytime i enter the token. Wat might be the prblm?  Pls help", "@KenyaPower_Care ref: 2676244, now a quick fix to hide your incompetence done by giving me a new ref:2681831 @KenyaPower @KenyaPowerAlert", "@KenyaPower_Care @kenyapoweralert what is the point of signing up for alerts, if I never get any communication of planned outages?", "@KenyaPower_Care Hi is there a planned outage in runda/ruaka/muchatha? No indication on the links what's going on?", "@KenyaPower_Care thank you.", "@KenyaPower_Care no lights in spring valley area along lower kabete road, what's up?", "RT @MatinaStevis: Hi @KenyaPower_Care an outage yet again in Kyuna. Can you please update us?", "@KenyaPower_Care please follow back i DM.", "@wachira69 @KenyaPower_Care @Kenya_Power no electricity in Buruburu phase 3. Please look into this.", "@KenyaPower_Care  power blackout for nearly 13hrs the whole of Njoro Town. Acc no. 3890094-01", "@KenyaPower_Care No response,several days down the line .....", "@KenyaPower_Care please send me the bill for acc 2542131-01", "@KenyaPower_Care ; @paraspethad ; @Umojaelectrical,  power interruptions at Umoja Rubber (Acc 535696) PLEASE advice Ref. NO. AND RECTIFY", "@KenyaPower_Care clearly you've proven that I wont get my token or money back neither you dont have the audacity to say what the issue is..", "@KenyaPower_Care You guys are waiting for an accident perhaps to happen so that you can prioritize ...??", "@KenyaPower_Care i have DM'd my mobile number.", "@KenyaPower_Care still on hold at the contact centre @KenyaPower @KenyaPowerAlert", "RT @camady: the impunity of kenya is @KenyaPower_Care  https://t.co/p3jal2Sebd", "Hi @KenyaPower_Care kindly\ncheck if my quotation is ready\nE21132015100966 thanks", "@KenyaPower_Care @AIRTEL_KE noted and thanks", "@KenyaPower_Care @KenyaPower @KenyaPowerAlert  ref: 2676244 still on hold #95551", "I think it's high time Ruaka residents n it's environs matched to their offices. Everyday blackout??! @mauryn @kenyapower_care @KenyaPower", "@KenyaPower_Care @KenyaPower @KenyaPowerAlert silence means?", "@KenyaPower_Care....we dont have electricity...a/c no 450067-01...kindly restore", "@KenyaPower_Care muthiga shopping center the side towards town my number is 0721804766", "@KenyaPower_Care u have completely refused to act on the power lines lying down along Malaba-Busia road.....sawa tu!!!!!!!!", "@KenyaPower_Care guys. Reply my tweet. Is there a scheduled blackout at Kayole,Naivasha today?????", "@KenyaPower_Care #95551  always been on hold for the last 37mins @KenyaPower @KenyaPowerAlert  ref: 2676244", "@KenyaPower_Care Thank you will appreciate ..have been in a black out for 2 days now", "@KenyaPower_Care Hi, please check for me the fixed charge debt in prepaid meter number 14106187777", "@KenyaPower_Care please give me a feed back..This is sad", "Hi @KenyaPower_Care an outage yet again in Kyuna. Can you please update us?", "@KenyaPower_Care is that am asking a stupid question or what .why am I not getting a feed back???", "Morning, @KenyaPower_Care is there a scheduled maintenance today in Ruaka?? And a fuse blew last night on the By-Pass transformer as well..", "@KenyaPower_Care Githurai 45 is off some areas....04214803373\nMy no.072900624....near lanes Academy", "@KenyaPower_Care we have not been having electricity for two days.. Uthiru(Gacwiri)", "RT @KenyaPower_Care: Airforce Ex Kimathi feeders is off affecting; Zawadi Pri, Gen Waruingi Rd, 1st Avenue, Ngei Est, Eastleigh S3, Kiambiu…", "@KenyaPower_Care we hv a criaz prob@hunters in kasaa,we hv bn having pwer blakout sinc sato n wen thy were restored jana they blinkd all nit", "@KenyaPower_Care Ref: 2676244 not yet attended to as promised earlier @KenyaPower @KenyaPowerAlert  and how long is the wait?", "Dear @KenyaPower_Care @KenyaPower I haven't had elec for 24hrs. Mtr no.01450677057 near Deliverance church Langata.pls advise on issue", "RT @KenyaPower_Care: Athi Ex New Airport is off affecting; Shell Depot, Nation Est, JKA Resort, Mbunge Est, Syokimau, Mlolongo &amp; environs.…", "@KenyaPower_Care Power out in Ruaka ac no. 14242770247. Please address.", "RT @KenyaPower_Care: Juja Rd Ex Huruma Feeder is off affecting; Moi Airbase, Mathare, Juja rd, 6th Street Eastleigh, Malewa Rd and environs…", "@KenyaPower_Care Was there a planned outage in Ruaka?", "@KenyaPower_Care Ruaka &amp; muchatha areas are not in the list of areas for scheduled maintenance. Power went promptly at 9. What gives?", "@KenyaPower_Care  i bought a token forMtr No : 14235323251 my token is 24740045463883514829 but it can't load.please help", "@KenyaPower_Care No ticket number narratives please.Just restore power 247844.No power for 2 days and counting", "@KenyaPower_Care @KenyaPower @BenChumo power out #WithoutNotice since 7am 4th May ref 2865031", "@kenyapower_care whole of njoro town 0731 465076", "@KenyaPower_Care KE44O1MIDG Confirmed. Ksh5,000.00 sent to KPLC PREPAID  for account 04204491205 on 4/5/16 at 1:23 PM", "@KenyaPower_Care what are you doing so far in regards to my problem...", "@KenyaPower_Care i want to activate my account please help, my business is at standstill and the trial 3 units are over", "@KenyaPower_Care 01452073081. 0724333811", "@KenyaPower_Care my phone number is 0702552455\nMy account number is 04211630167", "@KenyaPower_Care No power for two days.Matter has been reported but no action Account no 2474844.Issue affecting several households in area", "@KenyaPower_Care do tell my\nApril bill for\naccount no.\n5044761-01\naccount name Peter mwangi\nmaina", "@KenyaPower_Care \rIs power getting restored in ruaka?", "@KenyaPower_Care Despite repeated assurances that this is being processed nothing has been done 5 days later! What's going on?", "@KenyaPower_Care. Still no response to this....?????", "@KenyaPower_Care  Thanks, I'll DM you the information", "@KenyaPower_Care outage in our line in Kasarani Sunton a/c no. 14105499207 from last night. Please address.", "@KenyaPower_Care ok am patiently waiting", "@shindanokmk  Yeah.. Thus, corruption is wide spread coz we fear to name and shame like @kenyapower_care", "@KenyaPower_Care good morning.Ruaka no power..3398647-01. Kindly advise", "@KenyaPower_Care hi. Is there a scheduled outage in Kayole,Naivasha?", "@KenyaPower_Care blackouts again and malindi office is ignoring calls on both lines. 2011167-01", "@KenyaPower_Care I request an explanation, this is untenable. My account no. is 2000045-02 , Virunga Apts on Rhapta road. Mobile 0721575773", "Very true RT @ShindanoKmk: lil_feloz_olez @kenyapower_care i think kenyans are scared of joining nd sueing the big fish...u cant do it alone", "How now @KenyaPower_Care How???? https://t.co/R2gSepsLvg", "@KenyaPower_Care this bill is not right and I m getting no help from your Customer service please advise urgently https://t.co/HQvaBFjfed", "@KenyaPower_Care I took okoa stima loan of 200 and I was given 0.9Kw that went off immediately. Meter no 14253362025", "@KenyaPower_Care No electricity the past 24hours. Langata. 01450312143. What are you doing doing about it? 24 hours!", "Does a blackout have to accompany rain every time @KenyaPower_Care ? Honestly it's too much! !!", "@KenyaPower_Care Please send me my bill. current meter reading: 164, Account number: 5238027", "@KenyaPower_Care 1/1 I hav been paying estimates of abt 2k the past few months then suddenly I receive a billing of 10k for this month.Why?", "@KenyaPower_Care @kot  01450046071 though I had given you yesterday.", "@KenyaPower_Care @KenyaPower falling pole on likoni Lane, off Denis Pritt road. https://t.co/Dsf6gB5uFg", "@KenyaPower_Care I know your just ignoring me on purpose, but I know a day will come that u will beg me to be ur customer a/c 2452278", "@KenyaPower_Care I have been without power since yesterday, I reported and was given the reference number 2684679. Kindly assist. Thanks", "@KenyaPower_Care status on ref number 2685653", "@KenyaPower_Care i have realized that it really takes long to get token when i use airtel money! @AIRTEL_KE", "@KenyaPower_Care morning,we've had no light in the last 24hrs but my neighbour does.acc no.82955-01.kindly advise", "@KenyaPower_Care hey there has been  power disruption  since Monday 14106619100", "@KenyaPower_Care you know basically the whole area is affected how's my no going to help &amp; why would you want my phone no 4? Just sort out", "@KenyaPower_Care I hope this time you will walk the talk. .no electricity from Saturday", "@KenyaPower_Care still no power 48hours later. Those technicians u normally say are on site huwa wanafanya nini? #ignore this tweet too", "@KenyaPower_Care Account number already included but there was no response. Ref. No. now assigned as 2685626. Other related Ref 2684342.", "@KenyaPower_Care CAN WE DEAL WITH THIS TODAY I WOULD LIKE TO BUY ANOTHER TOKEN, AND THIS SEEMS TO BE DRAGGING!!!!", "@KenyaPower_Care Plz refer---@Cookyshious Hi Comrades, Please assist to generate tokens for Trans ID: 1605071880292. ^Jamo @KenyaPower_Care", "@KenyaPower_Care OH MY GOODNESS...YOU ALREADY GAVE ME THIS TOKEN AND I TOLD YOU ITS USED!!!", "@KenyaPower_Care Brownout in Athi River. Black out would have been better. Please provide an update. CC @KenyaPower", "@kenyapower_care yes, that is it. I need to know why it won't load.", "@KenyaPower_Care Still waiting for your response", "@KenyaPower @KenyaPower_Care stima hakuna in ongata rongai some line for few day n nights n its not attended until now.please!", "@KenyaPower_Care morning;15 107 as it's now", "@KenyaPower_Care that is not clear, the more the units the more expensive?", "@KenyaPower_Care  Thanks comrades. ^Caro @dakarn2000", "RT @KenyaPower_Care: Good morning. Please click on https://t.co/eKQLEQ91Qz or https://t.co/WIJAK8u8kn for details on planned outages for th…", "@KenyaPower_Care pliz investigate my bill, its abnormal. 28142774, Nakuru. A single meter ksh. 1119. 41 yet neighbors' ksh. 17 combined!", "@KenyaPower_Care And Now the whole area is powerless since yesterday 7pm. Please sort out. @KenyaPower", "RT @AOgolla: @NyeriYetu @KenyaPower_Care @KenyaPower @JimbolaRware So many new connections (Good) But 50% availability and consistency in P…", "@KenyaPower_Care No power in some houses at Kahawa Wendani AGAIN! since last night at 9..a/c 04220019691 phone 0720852293", "@KenyaPower_Care the problem has been sorted. Thank you.", "@KenyaPower_Care you guyz are worst people when it comes to customercare!!!in o/rongai kins archarde area..lights off 4days now!!!4days!!!!", "@KenyaPower_Care good morning, we still have no power since last night", "RT @Sonniemuhindu: I second you on this @NyeriYetu, @KenyaPower_Care should act now https://t.co/W9TPIJTbkh", "@KenyaPower_Care  where is my token", "@KenyaPower_Care  ALWAYS TAKING AS BACK TO NYAYO ERA. THE DARK DAYS.", "@KenyaPower_Care you can't be serious!48hrs are gone since  I bought the units and informed you of non receipt. super inefficiency!! @kot", "I second you on this @NyeriYetu, @KenyaPower_Care should act now https://t.co/W9TPIJTbkh", "@KenyaPower_Care   Follow back for DM", "@KenyaPower_Care not  yet received tokens account 14106120836 transaction id  1605071910388 phone number 0786230193", "@KenyaPower_Care our lights have been dim for the last 24 hours and there doesn't seem to be any effort to rectify.Ruthimitu area Ac 2399931", "@KenyaPower_Care DM (1)", "@KenyaPower_Care should we prepare for a scheduled maintenance today in and around Ongata Rongai?", "@kenyapower_care  the transformer was replaced but upto today morning there were no lights. whats rily going on?", "@KenyaPower_Care REF NO. 2679169 has taken a whole 5 days to sort out despite ur everyday promises to restore power.Whats the way forward?", "@KenyaPower_Care please we need power at hunters ...you want all of us to come at your offices for you to fix this or what", "@KenyaPower_Care what do you come here to do daily then you end up solving nothing??", "@KenyaPower_Care @john_kingara_35 have come for the ref no several times n being told to wait", "@KenyaPower_Care please do something about power at hunters...this is a joke the second week still no power ...what do You take us for?", "@KenyaPower_Care  Live and low power cables, leaning pole in Kayole just behind Cooperative Bank Kayole. Kindly help https://t.co/Vc151OXbPS", "@KenyaPower_Care 26 hours and still counting...no response from your end. Can we please have a solution to the blackout reported.", "RT @Ryherb_Gachui: @KenyaPower_Care  We can come to your offices and queue the whole day for Tokens. I have paid so DELIVER!!!! @ConsumersK…", "@KenyaPower_Care explain what you mean by current bill is 4307..I got a bill of 11140kshs as of May 3rd.Is it a rectified bill?", "@KenyaPower_Care Thank and much appreciated. Problem solved.", "@KenyaPower_Care hi, what is the turn-around time for you to reply a querry? @KenyaPower_Care", "RT @AOgolla: @NyeriYetu @KenyaPower_Care @KenyaPower @JimbolaRware So many new connections (Good) But 50% availability and consistency in P…", "Very sad that investors would close down due to frequent power outages in Nyeri @KenyaPower_Care @JimbolaRware  https://t.co/8Y92udaMmj", "@KenyaPower_Care taking too long... 1 week", "@NyeriYetu @KenyaPower_Care @KenyaPower @JimbolaRware So many new connections (Good) But 50% availability and consistency in Power (V. Bad)", "Eish @kenyapower_care rudisheni stima bwana", "@kenyapower_care the account number is 2225791. phone number is 0722994663", "@KenyaPower_Care @KenyaPower These power outages need to be addressed once and for all @JimbolaRware  https://t.co/8Y92udaMmj", "@KenyaPower_Care experiencing problems and dim lights reference 0118564-01 Githurai 44 please help", "@KenyaPower_Care still no power this morning and no feedback. Are techs working on it?", "@KenyaPower_Care 0706367905", "@KenyaPower_Care kindly send a team now. It's exactly one week without service delivery and your Kisii emergency is taking longer", "@KenyaPower_Care I got a bill of 11000 .Do you mean it has been corrected and my account will be credited with the extra amount paid?Explain", "@KenyaPower_Care it's all good now. Thanks", "@KenyaPower_Care please help partial blackout in the building and there was a loud noise at the transformer near our building 3820286-01", "@KenyaPower_Care Mtr No : 14243116283 is not activated , Please contact KPLC.that was the message i got after paying the cash", "@kenyapower_care RW, I confused my postpaif metre numbervwuth my neighbour's, mine is  61592832. Kindly DM me the bill", "@KenyaPower_Care .hi kindly assist", "@SafaricomLtd  nktststst Partners????!!!!!!  Indeed @KenyaPower_Care", "@KenyaPower_Care Pls note that am not able to pay my bill (702657) at uchumi supermarket,what is up?Can u pls activate  my data?", "@KenyaPower_Care I wont confirm ua such a disappointment. So tell me how to get token without begging", "the impunity of kenya is @KenyaPower_Care  https://t.co/p3jal2Sebd", "@KenyaPower_Care Yesterday I registered a complaint and you never responded. Please restore power at Hunters. you are inconvienencing me.", "@KenyaPower_Care  ni mwaganwo!", "@KenyaPower_Care I use prepaid account and I want to know how much is monthly fixed charges?", "@KenyaPower_Care will the occurrence every month we go without light. This has been happening the past eight years", "@KenyaPower_Care  Mungu anawaona mkitesa common mwanainchi!!!!  @FirstLadyKenya", "@KenyaPower_Care kindly check DM.", "@KenyaPower_Care Gosh it's me again!!! My stored food will spoil I BEG U TO SEND ME TOKENS.  Yes I paid si loan naombaKPLC @ConsumersKenya", "There are low hanging power lines in the Happy House/St Louise area of South C that are still live @kenyapower_care. Please send a team.", "@KenyaPower_Care the same was forwarded to your revenue department yesterday and still no token generation. Time frame perhaps?", "@KenyaPower_Care @consumerskenya blackout for 2 days meter no14243466787 please help", "@KenyaPower_Care I am still waiting for the SMS. How long will this take?", "@KenyaPower_Care still waiting in darkness", "Morning @KenyaPower_Care we have been in blackout from yesterday at Utawala, Githunguri  the line of meter 37150446179. Could you fix it?", "@kenyapower_care the meter number 22120140730... Not outage... Your switches connecting the meters blew from the Saturday outage.", "@KenyaPower_Care Please assist Time area Ikonge Nyamira we are in darkness. Last 2wks we had power for 2days", "@KenyaPower_Care waiting for power restoration now.", "@kenyapower_care I would like to DM you guys but I have no option for that", "@KenyaPower_Care Take a look at @brian_mutai's Tweet: https://t.co/U76oF6JbXb", "@KenyaPower_Care how difficult is it to get reconnected. As of today, its a week and a half. This is unfair!!", "@KenyaPower_Care no power sunrise donholm selected houses from 2nd my account no 0084656-02  please handle it", "@KenyaPower_Care kindly follow so i can dm", "@KenyaPower_Care @KenyaPower I already did that last time ..until even gave me a reference number ..", "@dakarn2000  Hi Comrades, please assist to generate tokens for the above transaction. ^Caro @KenyaPower_Care", "@KenyaPower_Care @mwanasiasa Power outage on 1 (414) 067-7924.Please attend to it.", "@AIRTEL_KE @KenyaPower_Care 1605071872671", "@KenyaPower_Care follow up all you want. Bottom line - YOUR MOMBASA TEAM WILL NOT ATTEND TO WORK UNLESS THEY ARE GIVEN A BRIBE!!", "@kenyapower_care    power blackout from yesterday around 7pm. What could be problem. Njoro accno. 3523625", "@dakarn2000  Hi Davie, Please share the transaction id number. ^Caro @KenyaPower_Care", "@KenyaPower_Care hi theres some cash i paid on this metre no.14243116283 and am being told that it is not activated.kindly assist", "@KenyaPower_Care for 200/- yesterday 4th May, I even gave transaction ID", "@KenyaPower_Care for 200/-", "\"@KenyaPower_Care: @arosto_ Hi, Kindly confirm query already answered.^ RW\" query pending not yet answered", "@KenyaPower_Care  sorry am not near the meters and out of town till tomorrow but the bills are suspect, any possibility of payment schedule", "@KenyaPower_Care I bought Tokens yesterday for acc 14140866998 using @AIRTEL_KE and av not gotten my Tokens", "@KenyaPower_Care halafu hii issue huwa kila baada ya siku...kwani wahandisi wenu wanabahatisha ama ni mangngu? Inakera sana inatia mori kali", "@KenyaPower_Care the power has just come back thanks", "@kenyapower_care but for how long will our business run into losses how long will our school going kids mis morning preps..", "RT @oleshitemi: .@KenyaPower_Care your staff caused the death of an innocent 8 year old due to negligence. Someone needs to pay https://t.c…", "@KenyaPower_Care what is the problem? How long will it take to sort it out? Will the repairs stop the persistent recurrence of blackouts.", "\"@KenyaPower_Care: @arosto_ Hi, Kindly confirm query already answered.^ RW\" Not answered.", "@KenyaPower_Care follow back upate ujumbe chemba yani DM. Transformer ya hii line iko entrance ya Kilifi GK prison.", "@KenyaPower_Care @KenyaPower @KenyaPowerAlert Please respond to my report of power blackout since yesterday 6am.", ".@KenyaPower_Care your staff caused the death of an innocent 8 year old due to negligence. Someone needs to pay https://t.co/x50H4JVboC", "@KenyaPower_Care noticed the token you are indicating was one I have used earlier!  I asking for the one bought yesterday", "@KenyaPower_Care Thanks power came back after 15 minutes", "@KenyaPower_Care wrong account number was 14234472773. The correct one is 14234472273", "@KenyaPower_Care I get message \"used\" when I try to load that", "@kenyapower_care Hi its been 18hrs any progress?", "@KenyaPower_Care Still nothing has been done! Are you guys serious about providing a reliable service?? Or are you just a bunch of jokers??", "@KenyaPower_Care 4424455-01 Kilifi,  oppoosite the Kilifi GK Prison", "@KenyaPower_Care good morning i have a question", "@KenyaPower_Care no power for 2 hours Mtwapa ACC 3654975 behind Gasoro Hotel / Destiny Inn", "@KenyaPower @KenyaPower_Care  help understand why a compound without occupants bills are averaging 60k a month' 4687871-1,..72-1, 468785-1,", "@KenyaPower_Care there is no electricity in our court  in Tassia since yesterday 1830hrs while other people have.What's the issue?Thanks.", "@KenyaPower_Care My account number: 2699580 mobile\nnumber: 0707301563 kindly consider us we've been living\nin darkness. Thank you.", "@KenyaPower @KenyaPower_Care @KenyaPowerAlert usiku kucha  mvua imekunya hamkuzima stima asubuhi mvua imeacha stima yapotea bila arifa...", "@KenyaPower_Care @KenyaPowerAlert namba yangu ya usajili ni. 4424455-01 #Kilifornia.", "@KenyaPower_Care @KenyaPowerAlert what's happening power hakuna asubuhi , tuende na vikoi kazini?Nguo hadi pasi😒 mbona hivi #Kilifi", "@KenyaPower_Care \nMorning,power lines lying very low at happy house off popo road south c,touching vehicles as they pass", "@KenyaPower_Care", "@KenyaPowerAlert @KenyaPower_Care @KenyaPower power blackout in Kilifi hivi asubuhi saa 0600hrs. Hatujapiga hata mswaki ,nguo pasi?😦😦", "@KenyaPower_Care no power since yesterday Ruaka bypass ac. 14253590286 kindly assist.", "@kenyapower_care Thanks for your feedback RW. Kindly forward to my email address mumbimmbei@gmail.com the account statement.", "@KenyaPower_Care okay thank you", "@KenyaPower_Care. Still in darkness 8 Hours after token payment Account #14107324213.Kindly Help Out. Awaiting.", "@KenyaPower_Care thanks", "@KenyaPower_Care hey I bought tokens for Metre no 14106946677 at for and yet to receive them kindly assist", "@KenyaPower_Care waiting", "@KenyaPower_Care no electricity in mathari area along the nyeri ihururu road......", "@KenyaPower_Care Acc no 14107381528 near chiefs office Imara Daima one phase has gone off and this happens everytime since last night", "@KenyaPower_Care oh... So you decided to replace it with another faulty one, eh?? Coz we were good until 8 pm jana then.... Jesus Christ...", "@kenyapower_care Kindly send me an account statement of the post paid metre number 61513788 to mumbimmbei@gmail.com", "@kenyapower_care Thanks for your feedback, I would also like you to inform me, from when this specific account has been in arrears. kindly.", "@KenyaPower_Care 14228814829 kasarani hunters area", "@KenyaPower_Care KE46O6G5SC Confirmed. Ksh500.00 sent to KPLC PREPAID  for account 14105331616 on 4/5/16 at 8:02 PM New M-PESA bal", "@KenyaPower_Care \n@KenyaPower \nNo power in entire kikambala area. Ac 3917346", "@KenyaPower_Care amount of kes 1,000 for 14251290053", "@KenyaPower_Care Still no power from 7pm yesterday", "@KenyaPower_Care @drbenchumo Ref: 2679319 Day 5 &amp; Counting NO POWER, #TOTALBLACKOUT", "@KenyaPower_Care kindly assist, what happens to the 250 I sent???", "@kenyapower_care Kenyan Govt is useless. Cant this monopoly end @Mtwapa we cant go a day without power outage?This is nonsense.Disapointed", "#Someonetellkplc @kenyapower_care we are very sick of Power outages in Mtwapa.Waking up to total darkness.Cant some1 do something", "@KenyaPower_Care thank you so much", "@KenyaPower_Care we havent had power for 5 days since saturday..there is a transformer fault along Murang'a-Kiria-ini rd at kagwanja primary", "@KenyaPower_Care am a concerned resident of kamathatha village gilgil sub county, what went wrong,still waiting for power,kindly respond.", "@KenyaPower_Care Not yet sorted ? Your SlA's are that long? Quite dissatisfied", "@safaricomltd  how can you help!!!! @kenyapower_care to  up their game on this token is i feel dissapointed i miss the old meters.", "@KenyaPower_Care no lights since the day before yesterday phase thing happening in langata  deliverance area please saidia", "@KenyaPower_Care @safaricomltd this digital toke buying is just a mess how do i buy tokens yesterday at 8pm now its 2:37Am still proccesing?", "@KenyaPower_Care  12 hours since I reported an outage with no response 2441329-02 Off Gichugu road Kileleshwa", "@KenyaPower_Care  We can come to your offices and queue the whole day for Tokens. I have paid so DELIVER!!!! @ConsumersKenya", "@Ryherb_Gachui Hope you have shared the transaction details with our partner @KenyaPower_Care , they'll sort you out.^TT", "@KenyaPower_Care  If you have delays it's civil to alert your clients not to use Mobile Money to buy Token.", "@KenyaPower_Care  9hours ago I bought token via Mpesa Trans ID KE4402H31C Foraccount number 14106901821 I'm still waiting", "@SafaricomLtd @KenyaPower_Care I need Tokens!!!", "@KenyaPower_Care still no account transfer from 14234472773 to 14234472273.", "@KenyaPower_Care :) Cool, ^Jamo", "@KenyaPower_Care , it is really disturbing that some parts of Hunters, Karasani have been in darkness for a week.", "@kenyapower_care MT NO. 01450108160 Phone 0722350765 Kindly pls respond considering power will go off 9-5pm Kesho. Yet its only a few houses", "@kenyapower_care Athi River, Makadara. 14251084803", "@KenyaPower_Care AND THEY WERE NOT 3 PURCHASES IT WAS ONE!", "@KenyaPower_Care SURELY THOSE TOKENS ARE USED, I NEED TOKENS FOR WHAT I PURCHASES YESTRDY, I HAVE ALREADY GIVEN DETAILS", "@KenyaPower_Care alc #3165236-01. Kindly assist with the bill. Thanks", "@kenyapower_care MT NO. 01450108160 Phone. 0722350765 Kindly pls respond.", "@KenyaPower_Care Hi, the issue was sorted but it has reoccured. We are back in darkness.", "@KenyaPower_Care Now two weeks no electricity in Shiriani, Kilifi. Why take so long?", "@KenyaPower_Care @KenyaPower Meter number 009943702,Acc no-165850-04.Need my Elec bills and payments done for Feb,March and April?", "@KenyaPower_Care Hello. Thank you for your assistance cc: @Wakibata", "RT @unclefelloh: @KenyaPower_Care how can we go without power for a whole week in kasarani hunters?? Somebody is sleeping on the job", "@KenyaPower_Care how can we go without power for a whole week in kasarani hunters?? Somebody is sleeping on the job", "@KenyaPower_Care 0721207438", "@KenyaPower_Care acct no 2889218-01 utawala Jetview next to. ACK ST Peters Girls School", "Hi @KenyaPower_Care where do we report lights that are not working installed under the street lighting programme?", "@KenyaPower_Care U guys r givin us shitty service, a whole fkn wk!?? Disco lights on our phase 04211724085 my no. 0723148732", "RT @zainabuzeddy: @OkumuEvans370 @gregri49 @KenyaPower @KenyaPower_Care Aki", "@KenyaPower_Care outage in south c near madina estate Dafam hotel.any feedback?", "@KenyaPower_Care 14140520660", "RT @zainabuzeddy: @OkumuEvans370 @gregri49 @KenyaPower_Care @KenyaPower stima zimerudi🙌", "@mohammedhersi @KenyaPower_Care you'd think we run factories in our houses.\ntime to demand a proper power audit", "@KenyaPower_Care   Could you please resend me token numbers for the last 2 transactions mtr no 37150650176, 1 of them got deleted by mistake", "@KenyaPower_Care mpaka SAA hii", "@KenyaPower_Care, I have used the same Mtr No : 04216407454for the last 3 years, imara Daima 0725407134", "@oleturana @KenyaPower_Care 2889218-01", "14106119952 golden villaz we are in blackout do smthng @kenyapower_care", "RT @BahatiMchelsea: Kenyapower hata wakanyage wire lazima tushinde sisi kama...@zainabuzeddy @gregri49 @kenyapower @kenyapower_care @okumue…", "RT @zainabuzeddy: @OkumuEvans370 @gregri49 @KenyaPower @KenyaPower_Care Aki", "RT @qinyua_Ben_Dr: @zainabuzeddy @gregri49 @kenyapower @kenyapower_care @okumuevans370 tune radio ama follow livescore", "@KenyaPower_Care @KerOkoth hi how come you hv ignored our pleas for help? Kenya school of monetary studies residential area no lights", "@KenyaPower_Care Mtr No. 01450666423  second time am providing it.", "@KenyaPower_Care \nI applied for meter separation on 6th April 2016 and have not received feed back. My id number is 20711304", "@KenyaPower_Care my token prepaid purchase has failed and MPESA has confirmed payment.  Kindly address this problem", "@KenyaPower_Care 2574751-01. tree is lying on the power cables and need be cut urgently. No power Shock everywhere https://t.co/lpi2l77dMV", "@zainabuzeddy @gregri49 @kenyapower @kenyapower_care @okumuevans370 tune radio ama follow livescore", "@KenyaPower_Care 2574751-01. Some tree is lying on the power cables and need be cut urgently. No power in school and church Shock everywhere", "RT @BahatiMchelsea: Kenyapower hata wakanyage wire lazima tushinde sisi kama...@zainabuzeddy @gregri49 @kenyapower @kenyapower_care @okumue…", "Kenyapower hata wakanyage wire lazima tushinde sisi kama...@zainabuzeddy @gregri49 @kenyapower @kenyapower_care @okumuevans370", "@OkumuEvans370 @gregri49 @KenyaPower @KenyaPower_Care Aki", "RT @zainabuzeddy: @OkumuEvans370 @gregri49 @KenyaPower_Care @KenyaPower stima zimerudi🙌", "RT @OkumuEvans370: @zainabuzeddy @gregri49 @kenyapower @kenyapower_care wame sikia kilio chako", "@zainabuzeddy @gregri49 @kenyapower @kenyapower_care wame sikia kilio chako", "@KenyaPower_Care I had purchased tokens worth 350 via mpesa.", "@KenyaPower_Care Kindly follow back for me to DM some queerry", "@KenyaPower_Care 'Mtr No: 01452098443 ,Token generation failed,Please contact KPLC'. That's the message I received from kplc.", "@OkumuEvans370 @gregri49 @KenyaPower_Care @KenyaPower stima zimerudi🙌", "@KenyaPower_Care ,no response up to now,what should I do", "@KenyaPower_Care what other information do you need besides the amount I paid and the meter number?i paid via mpesa and I have the messages", "You guys should just liquidate @KenyaPower_Care", "@KenyaPower_Care @KTNNews @citizentvkenya Since #KenyaPowerDon 'tCare, pls tell them A/C#04205424288 is using KenyaParaffinLampCandles 2nite", "@kenyapower_care our power was erroneously disconnected on Friday last week. no help has been provided so far despite numerous calls to you.", "@KenyaPower_Care @KenyaPower @ConsumersKenya 5 days down the line and there's no action.  What's happening? We are still in the dark.", "@KenyaPower_Care,04225864752 in Guthurai 44,transformer near the High voltage Electricity mast,near St.Gladys high school.", "@KenyaPower_Care thanks", "@KenyaPower_Care  outage said lights out till 5pm...why no lights till now? https://t.co/NvpVrxsPGj", "@KenyaPower_Care  power has just come back for an 1hr n its gone again. When are we going to have a lasting solution to this. Saidia", "@Kenyapower_Care You guys are so boring. Power gone again in Athi! Line moja. really affecting biz!", "@AIRTEL_KE @KenyaPower_Care WHAT'S HAPPENING REALLY NEED THE TOKEN.....", "@KenyaPower_Care how long does it take coz am in darkness", "@KenyaPower_Care hi,i have top up some cash on this metre number 14243116283 and am being told that it is not activated kindly assist", "@KenyaPower_Care i have 1000 shillings for buying a token and u have send me a mssge tat it has fail hw can u help me plzz", "@KenyaPower_Care hey, be were of porn, guns and drugs. Mosquitoes celebrating coz I can't see them. Can you switch the lights on?", "@KenyaPower_Care the electricity keeps fluctuating near the Mavoko Law Courts. What's the issue?", "@KenyaPower_Care we have not had power for the last two days in lower kabete. We lodged a complaint ref no 2682587 nothing has been done.", "@KenyaPower_Care this one is used, please resend me the other token number that I bought around the same time in January", "@KenyaPower_Care", "@KenyaPower_Care never mind 😊", "@KenyaPower_Care to a point of being ignored, its day three of blackout around ongata rongai, nafrom area around thorn tree, it aint fair", "@KenyaPower_Care Y are u people assuming its almost five hours.", "@KenyaPower_Care !!!!!!!!!!!!!!!!!!", "@KenyaPower_Care we have been experiencing power outages at survey area along Thika road.. Whats the problem?", "@KenyaPower_Care lights have  been on n off lights afraid our bulbs will burn please take this as an urgent matter no lights in pangani", "@KenyaPower_Care we have no power since 7am! What is happening?!!!!!", "@KenyaPower_Care kindly look into the matter", "@KenyaPower_Care kindly help have bought tokens and have received that token generation faild.... mrt.No 14251797172", "@Cookyshious Hi Comrades, Please assist to generate tokens for Trans ID: 1605071880292. ^Jamo @KenyaPower_Care", "@KenyaPower_Care 2/5/16 Monday my number is 0734732027", "Hi Freddie, my apologies. Will follow up your issue @Fromosh @KenyaPower_Care", "@KenyaPower_Care hope this is fixed since your team comes to site, fixes then in the next 2 hrs  they go down", "@KenyaPower_Care Mtr No: 14246325675 ,Token generation failed,Please contact KPLC.  \nThis evening", "@KenyaPower_Care still nothing has been done. What a joke service. I will offer your Mombasa team a CASH BRIBE and see how fast it gets done", "@KenyaPower_Care the meter is displaying 'Con-Fail'", "@KenyaPower_Care surely I've tweeted you four times since 4pm today. Why are you ignoring me? No lights in Kenya school of monetary studies", "RT @FarhanaY: @KenyaPower_Care good morning. There is no power in nairobi pangani for more than 40 hours now. And no ongoin repairs have be…", "RT @bonnymwas: @KenyaPower_Care morning. No power in Pangani for the last 24hrs. Whats happening?", "@KenyaPower_Care @muyanga_james same old story since monday", "@kenyapower_care Thank you so much for your fine, efficient and prompt service. Will sort it out soonest possible.", "RT @Dmmuchai: @KenyaPower_Care @KenyaPower  we have been in darkness for 6 days in a row and am just at Pangani less than 5 mins drive from…", "@KenyaPower_Care please confirm wat.causes our lights to go on dim  ND . eventually blackout acc.238561.", "RT @joanzoya: @KenyaPower_Care No power in Pangani-Agoi Road since last night. Advise on status", "RT @sleeplesslee: @KenyaPower_Care Hi. What's the status in Pangani? We've had no electricity since last night. Account no: 074839-01.", "RT @Kriisstie_M: @KenyaPower_Care hey! No power in Pangani since yesterday at 10PM.... What's  going on?", "RT @jkhabwe: Why can't @KenyaPower @KenyaPower_Care @KenyaPowerAlert sort out this perennial problems of power outages in pangani @ketercha…", "RT @nyokabisays: @KenyaPower_Care- No electricity yesterday during the day, no elec for almost half day today then dim lights now in Pangan…", "@KenyaPower_Care that means we're being sorted tonight?", "RT @Sir_Wamae: @KenyaPower_Care it seems you really want us to enjoy candlelight dinner in Pangani for 3 days now. Vision 2030 mtawezana na…", "RT @Nellykama: @KenyaPower_Care @KenyaPower @KenyaPowerAlert no power in Pangani area around Heights for the second night. Can you kindly e…", "@KenyaPower_Care thank you", "@KenyaPower_Care blackout still", "JESUS CHRIST YOU GUYS!!!! @KenyaPower_Care 😒", "@KenyaPower_Care This is the meter number Mtr No: 14250838076", "@KenyaPower_Care @AIRTEL_KE  Token for 14140500324 purchased by 0734803523 has not been received since 4p.m. ASSIST ASAP!", "@KenyaPower_Care kindly assist....urgently!", "@KenyaPower_Care Mtr No: 14250838076", "RT @keruwaweru_: #ThieUkiumagaBecause you have decided to switch off light in pangani  @KenyaPowerAlert @KenyaPower_Care @KenyaPower", "Excuse me @KenyaPower_Care please fix the power issue in South B. 😑", "@KenyaPower_Care  been calling and getting ref number with no action.. This is un acceptable, our business rely on power act now KPLC", "@KenyaPower_Care A/C 14105503412 Phone: 0728747061. Kindly solve these problem once n for all. Electricity fault since sat 30th April", "RT @keruwaweru_: #ThieUkiumagaBecause you have decided to switch off light in pangani  @KenyaPowerAlert @KenyaPower_Care @KenyaPower", "#ThieUkiumagaBecause you have decided to switch off light in pangani  @KenyaPowerAlert @KenyaPower_Care @KenyaPower", "@KenyaPower_Care  seems you are deliberately frustrating our business... How can we be in the dark for 2 days no response from your end?", "@kenyapower_care finally power now seems to be stable. Thanks.", "@KenyaPower_Care token generation faild??? Acc 14251797172\nKindly sort this out already bought token.", "@KenyaPower_Care Token generation failed for my prepaid meter.\nwhile my mpesa has confirmed payment to kplc", "@KenyaPower_Care pangani mtoni residence no lights,, do something", "@KenyaPower_Care The account number is 3138158-01. Power has disappeared in our area. Urgently assist. Was doing something so vital.", "@KenyaPower_Care acct no 14242437946 pangani black out since yesterday ref: 2684619 honestly no action till now....", "@KenyaPower_Care why is there no electricity on forest road? Yesterday also we had no power. All day all night", "@KenyaPower_Care is it possible to pay the electricity bill using equitel money", "@KenyaPower_Care hii mchezo mmeanza haifurahishi. why wait til game time n cut the power?? a/c no is 14245695383.funyula,busia", "@KenyaPower_Care  No power in Waithaka. A/C No. 2215452-01. Please advise.", "@KenyaPower_Care hey st .teresa and parts of mlango kubwa no electricity for 2days", "hi, please check for me the pending bill for A/C no: 2393913-01 @KenyaPower_Care", "@KenyaPower_Care Hi \nLights keep going and coming for a while only account number 0074857", "@KenyaPower_Care have sent mpesa request for token meter no.  14251290053  an got failure message .. Please assist with token no.", "RT @wanjiru_kev: @K24Tv @YussufIbra @Karimi_Karen please plead with @KenyaPower_Care waturejeshee stima south b", "@cherukevin nkt @KenyaPower_Care please respond!", "@KenyaPower_Care still don't have power", "@ktymz @KenyaPower_Care  still waiting for power to be restored 7 days later.", "@kenyapower_care Power outage.. meter no 14140879694 ...phone no 0711683451..", "@KenyaPower_Care Mtr No: 01450179062 ,Token generation failed,Please contact KPLC. please help me am in the darkness", "@kenyaPower_Care day three of blackout, ongata rongai nafrom area around thorn tree yani no help no lights no sighn of you pple", "@kangai @KenyaPower_Care I share that dream. They have the temerity to spend our money declaring \"profits\" in the billions. Utter rubbish", "@KenyaPower_Care please help am buying token on mpesa and am getting this.. Mtr No: 01450179062 ,Token generation failed,Please contact KPLC", "@KenyaPower_Care... Some parts of githurai 45 we have no lights!!!", "@KenyaPower_Care ?", "@Wakibata Hi Comrades, Please assist to generate tokens for Trans ID: 1605071914217. ^Jamo @KenyaPower_Care", "@KenyaPower_Care @KenyaPower. Kindly assist I have accidentally entered the wrong meter no. My meter no is 14140030702, kindly but urgently", "@KenyaPower_Care ..kindly confirm to me the position of this account number 3470848-01..0714802375..i am without electricity", "@AIRTEL_KE @KenyaPower_Care Trans ID: 1605071914217 You have sent 500Ksh to My Power in reference to account 04225674987. Generate token", "@kenyapower_care meter no. 14252191367", "@KenyaPower_Care Utawala Ruai Rd Agape SDA church 0720-230394", "@KenyaPower_Care it seems you really want us to enjoy candlelight dinner in Pangani for 3 days now. Vision 2030 mtawezana nayo kweli!", "@KenyaPower_Care since Saturday nyt we have not been having power supply we can't even watch news n follow what is happening in our country", "@KenyaPower_Care  electricity supply in Waithaka has very erratic &amp; unstable. Have lost one energy saver bulb another  blackened A/C 2196122", "@KenyaPower_Care Hi, kindly check DM", "@KenyaPower_Care I need tokens for this please.Trans ID: 1605071865628", "@KenyaPower_Care kindly assist me with your emergency telephone numbers...", "_@KenyaPower @KenyaPower_Care evidence of payments and bills available upon request", "@KenyaPower_Care Good evening..  I have bought token worth 3000 shillings but it has refused to go through.  kindly assist urgently", "@KenyaPower_Care  mnanisaidia ama", "@KenyaPower @KenyaPower_Care evidence of payments and bills available upon request", "@KenyaPower_Care no power the whole Day !!! check thiss account # 14140758096 . Muthua, Uthiru. am not impressed", "@KenyaPower_Care @KenyaPower 4101531-01", "@KenyaPower @KenyaPower_Care you charged me consumption from 07/03-22/04  yet end March I paid a bill.on 24/03/16 MPESA ref KCO2Q5050.", "@KenyaPower @KenyaPower_Care my meter number is 4101531-01 a whole stretch without lights for 14hrs please assist 0714129243", "@KenyaPower_Care we have no power since 7am today. Mtr No. 04214898951 in Langata", "@KenyaPower_Care hi its now Fifth day without power.kindly do something.acc- 2689102-01", "@KenyaPower_Care my meter number 04213126479...on /off since 7:45", "Hamia city aisee! @KenyaPower_Care team never have a team around that area😝 https://t.co/MbQqbTOR3i", "@KenyaPower_Care it's going into Fifth day without power.kindly do something", "RT @parastatal_Afr: Economic Survey: Rural power connection up 33pc to stand at 703,190 customers @MyGovKe @KenyaPower_Care https://t.co/VW…", "@KenyaPower_Care Please sort out the issue at pangani....it's been on off since 7:45. Surely and no one's answering the line", "@KenyaPower_Care please answer my DM", "@KenyaPower_Care  hi, bought tokens a while ago via mpesa but they were never generated. Kindly help..  Mtr No. 14244384641", "@kenyapower_care 0720951394", "@KenyaPower_Care all looks OK now, thanks. https://t.co/sttofZv0qi", "@KenyaPower_Care @oleturana still no Power for the second day running I must buy a solar panel or generator this month. #Pundamechoka", "@KenyaPower_Care I bought tokens on Monday still no response from your end", "@KenyaPower_Care kindly do something about Old Donholm. Some areas don't have electricity. Since morning what's happening surely", "@KenyaPower_Care A complaint with the ref 2685212 logged for prepaid meter no 14252464418 in #OngataRongai. Why the frequent outages?", "@KenyaPower_Care Mtr No : 04216407454 is not activated , Please contact KPLC what can be the issue? Loaded last on 7/4/2016", "@KenyaPower_Care hi, I just bought tokens and I am told \"failed\" whenever I key in the digits. What could be the problem?", "@KenyaPower_Care kindly assist me in knowing how much to pay for this post paid metre number 61513788", "@KenyaPower_Care @KenyaPower We are in total blackout since 9pm. A/C#04205424288. Please restore power as soon as possible. @ConsumersKenya", "@KenyaPower_Care  Surely, no rains...and power goes off in Rimpa! Nooo", "@KenyaPower @KenyaPower_Care https://t.co/b7pM8M259U", "@KenyaPower_Care I have sent money to your acc to purchase tokens...but the msg from your end is that token generation has failed! Meaning?", "@KenyaPower_Care 5 days with no power and now its back and flickering after one minute so unfair kasarani hunters", "RT @franmuya: Every time I forget that I'm living in a third world country @KenyaPower_Care reminds me. These days we are having blackouts…", "@KenyaPower_Care My token generation has failed. Please assist.", "Tuheshimiane @KenyaPower_Care @KenyaPower .. Tangu 10 am stima mlipeleka wapi ?", "@KenyaPower_Care KE40NZB4XE Confirmed. Ksh200.00 sent to KPLC PREPAID  for account 14140878303 on 4/5/16 at 9:44 AM", "@KenyaPower_Care yo!!! help a brother out!!!!", "@KenyaPower_Care Mtr No : 14140878303 is unknown or is invalid ,Please confirm or contact KPLC", "@KenyaPower_Care send me paybill numbers", "@KenyaPower_Care  Could you please resend me token numbers for the last transactions from Jan this year mtr no 37150650176, got deleted.", "@kenyapower_care then my meter doest work so I cnt give a current reading,", "@KenyaPower_Care I did pay but wrote the last account number wrongly kindly assist", "@KenyaPower_Care assist me with tokens for14244716248", "@KenyaPower_Care one phase on and off at Pangani Northview rd acc01451128662.", "@KenyaPower_Care No power in the souse since morning 04225864752", "@kenyapower_care hi, ur not responding, still waiting for ur assistance, my bill too high, 2784762-01", "@KenyaPower_Care  I paid 350KSH to buy tokens for meter number: 01452098443 on Saturday and got the message 'Token regeneration failed'.", "@KenyaPower_Care A/C 14105503412 kasarani hunters why these repeated unsolved faults??", "@KenyaPower_Care On and Off power at Northview road Pangani A/C No. 04216608135", "@KenyaPower_Care What's up with this meter number?  14246325675!  I can't buy units.", "@KenyaPower_Care. I see its becoming a drill No power everyday huh???? Still waiting!!!!", "@KenyaPower_Care back out acc no: 4648039-01/ 4648056-01 .... We are the only ones without power kindly advise", "@KenyaPower_Care mbona my concern is not being addressed....", "@KenyaPower_Care Thank you Juliet for your swift action handling ref#2683355. Mungu akubariki.", "@KenyaPower_Care oi. My lights keep flickering on and off.. Bloody irritating.", "@KenyaPower_Care Thanks for attending to my complaints, I can at least charge my phone number say thank you", "@KenyaPower_Care  we can't live under shoddy work by your team at hunters kasarani. Please solve the issue once n for all", "RT @KenyaPower_Care: Good evening,Kiserian Ex Matasia is off on a fault.Areas affected: Kiserian,Rimpa,Nkoroi,Rongai,Kandisi.Our technician…", "@SafaricomLtd hi tokens bought frm 0728686788 acc 01450313281no confirmation text yet from you. Urgent help @Safaricom_Care @KenyaPower_Care", "@KenyaPower_Care @KenyaPower @KenyaPowerAlert no power in Pangani area around Heights for the second night. Can you kindly edify on that.", "@KenyaPower_Care No power at 257722901,kindly advise on the issue.", "@KenyaPower_Care @KenyaPower @KenyaPowerAlert ^BT Asante sana and waiting for a favorable response from your team, have a blessed goodnight", "@KenyaPower_Care restored", "@NyokabiLucy It's crazy out here. Outages are the norm here now. They never fix the problem permanently. @KenyaPower_Care", "@KenyaPower_Care BT /SW kindly resolve no lights for two days Kenya School of monetary studies residential area account number 119900-04", "@KenyaPower_Care Mnaongojea game ikikaribia kuanza mnakata stima south B?", "@KenyaPower_Care hi I have logged a complaint still no response", "@ItsKamauNjuguna noooo outage again? @KenyaPower_Care should fix your area permanently.too many outages", "@KenyaPower_Care No lights huku Plainsview ,South B.", "@K24Tv @YussufIbra @Karimi_Karen please plead with @KenyaPower_Care waturejeshee stima south b", "@KenyaPower_Care thank you, power finally restored.  But check on this transformer; every week it's the same old story", "@KenyaPower_Care @KenyaPower_Care my account 04216022873. Got it thanks.", "@KenyaPower_Care black out in south b", "@KenyaPower_Care a/c 14141029893 I have bought tokens twice today and cannot load,reads rejected,can't get through to customer service..busy", "@KenyaPower_Care power outage #37155988704 in south c Dafam area", "@KenyaPower_Care  it sucks big time to come home to no lights 😢 Saidia Please 37125107971", "@KenyaPower_Care  no power in South b balozi estate. AGAIN!😠", "@KenyaPower_Care power outage south b ac no 0159954-01", "@KenyaPower_Care if you don't get electricity back in my hood before the Madrid game starts, you'll all die a very painful death", "@KenyaPower_Care @KenyaPower @kenyapower ref:2676244 give me timeline. an outage for 3 weeks?", "@KenyaPower_Care . Black out in Pangani. Any idea why?", "@energy_ke @JNgangaERC @KenyaPower_Care Solar energy is limitless &amp; clean. Lets make it affordable 4 all in #Kenya. https://t.co/zhBWG4IMzx", "@KenyaPower_Care Black out. Again. This is such a mess. Please do better. 😥😥😥😥😥😥 \nSouth B Balozi", "@KenyaPower_Care @KenyaPower @KenyaPowerAlert Tafadhali mchangamkie hiyo ref yangu iko kwa DM over to you ^BT", "@KenyaPower_Care outage in south B Riverbank estate", "@KenyaPower_Care  South B,  Plainsview, Sore Drive, your normal Blackouts seem to be back. What say you???", "@KenyaPower_Care I have purchased tokens via Airtel  my Trans ID: 1605071618670 account number is 14252709663.", "@KenyaPower_Care south B hakuna power", "@KenyaPower_Care Good evening. Please respond to my DM.", "@SafaricomLtd hey tokens bought from 0728686788 acc no. 01450313281,no confirmation text yet from you. Urgently respond @KenyaPower_Care", "@KenyaPower_Care Please bring power back to a line in Kahawa Wendani. Metre No 01450065477.\nIt's urgent. Thanks.", "@KenyaPower_Care Mtr No: 37152159721 ,Token generation failed,Please contact KPLC", "@KenyaPower_Care  This persistent power outage in Hunter, Kasarani is hell...DO SOMETHING for heavens sake!!!", "@KenyaPower_Care ^BT umeona hiyo reply yangu?", "@KenyaPower_Care 01450490717. Power outage. Please restore.", "RT @mimininani: @KenyaPower_Care lights out in kapiti crescent south b. Pls assist", "@KenyaPower_Care hey we bought tokens on acc no. 01450313281 before 7 still no tokens yet. Pls urgently help", "@KenyaPower_Care lights out in kapiti crescent south b. Pls assist", "@KenyaPower_Care What's up in Kajiado town for over a wk  voltage is low &amp; lights dim forced to switch off electronics. Ac 2509729-01.", "Hello @KenyaPower_Care power out huku.\n3432460-01. 'Sup?", "@kenyapower_care hallo what's going on?  No response?", "@KenyaPower_Care check DM", "@KenyaPower_Care ^BT see DM replied. Respond", "@KenyaPower_Care please respond again", "@KenyaPower_Care unstable power in south b a/c 14105549571", "@Kenyapower_Care please restore full power on a line in waithaka along kikuyu road. lights are dim. Account number 38009", "@KenyaPower_Care am still waiting for your feedback", "@KenyaPower_Care lights bana...\n3628951-01 in Pangani", "@KenyaPower_Care More sparks. Hazard to children https://t.co/qEfQisyVyo", "@KenyaPower_Care kindly let your technical team know that we are still cut from the national power supply  day 6 without power supply", "@KenyaPower_Care \nWat's happening in Funyula honestly, ata kama ni rationing I think it's always proper to communicate.", "Guys I have bought tokens,,, no confirmation from safaricom..... Don't know what's going on? @KenyaPower_Care  @Safaricom_Care", "@kenyapower_care MT NO. 01450108160 Phone. 0722350765", "@KenyaPower_Care NO POWER AS USUAL WHILE IN THE STREETS, THERE'S POWER?!?!????????", "@KenyaPower_Care lights still flickering... On/off every 2 minutes. Any help soon?", "@KenyaPower_Care 2442711-02...WE DON'T HAVE POWER?!?!?", "@KenyaPower_Care I  bought tokens for account no 1422913955 via MPESA and I have not received them.. Kindly assist", "@KenyaPower_Care Ahsante sana for ua feedback.", "@KenyaPower_Care It's a blown transformer which is affecting a whole area", "@KenyaPower @KenyaPower_Care You charged me consumption from 07/03-22/04  yet end March I paid a bill...on 24/03/16 MPESA ref KCO2Q5050", "@KenyaPower @KenyaPower_Care you charged me consumption from 07/03-22/04  yet end March I paid a bill...on 24/03/16 MPESA ref KCO2Q5050", "@KenyaPower_Care I need tokens  Trans ID: 1605071618670 account 14252709663", "@KenyaPower_Care, kindly address the phase failure that is so chronic in Kahawa Wendani. No power now. A/c no 01450407885", "Hi @Safaricom_Care  I just bought some tokens from my mpesa account, no confirmation received yet,,, what is wrong? Cc @KenyaPower_Care", "@KenyaPower_Care Power outage Account No: 2783900-01 Please let me know if there's a possibility of having it back tonight. Thanks.", "@KenyaPower_Care after going without power since Saturday to last afternoon, will you still switch off the power in Ruaka tomorrow? Really?", "@KenyaPower_Care No tokens and have paid via airtel money trans ID 1605071910388", "@KenyaPower_Care- No electricity yesterday during the day, no elec for almost half day today then dim lights now in Pangani. It's ridiculous", "@KenyaPower_Care kindly restore power to this a/c 14105338686.", "@KenyaPower @KenyaPower_Care you charged me consumption from 07/03-22/04  yet end March I paid a bill...", "@KenyaPower_Care token for 14242554625 plz I sent 220 no feedbak", "@KenyaPower_Care have not had electricity since morning, please advise on  status a/c 04211630605", "@KenyaPower_Care this token no is not working  24740045463883514829 my Mtr no is Mtr No : 14235323251.whats wrong", "@KenyaPower_Care one phase is off at 87 some Pple have lights others dnt ....Please check 2992521.", "@kenyapower_care still no power, almost two weeks later... Useless!!", "@KenyaPower_Care Mambo vipi Ref:2676244?", "@KenyaPower_Care @fndaga @KenyaPower sinces yesterday forest.road no power. Some1 sliping on the job. 2 days no power.2238030", "@KenyaPower_Care KE46O6G5SC Confirmed. Ksh500.00 sent to KPLC PREPAID  for account 14105331616 on 4/5/16", "@KenyaPower_Care Hi please resolve power problem within kenya school of monetary studies residential area", "@KenyaPower_Care my Mtr No : 14235323251 Token : 24740045463883514829 - Kshs : 1000 Units : 73.51 but still I can't load .Help", "@KenyaPower_Care There seem to be a problem power supply.. its on dim then off.. Please recrify it. at Hunters, Nairobi.", "@KenyaPower_Care I sednt you a DM yesterday. No responce yet.", "@KenyaPower_Care Mtr No: 37152159721 ,Token generation failed,Please contact KPLC kindly assist", "@KenyaPower_Care after 5days without lights the least y'all cn do is give us stable lights.Make up ur minds.Are they on or off?NKT!", "@KenyaPower_Care what's wrong with  power  @ pangani lately? On $ off. Right  now on off $ deem.", "@KenyaPower_Care  Could you please resend me token numbers for the last 3 transactions mtr no 37150650176, 1 of them got deleted by mistake", "@KenyaPower_Care meter no. 5238027-01, current reading: 164", "@KenyaPower_Care 14251957941", "@KenyaPower_Care", "Leave this fuckers alone I think they have better things to do than answer queries @betty_kioko @KenyaPower_Care", "@KenyaPower_Care  @KenyaPower @KenyaPowerAlert Please check on your DM and revert on Ref:2676244", "Hey no power in our line homabay_makaburini  what's happening @KenyaPower_Care", "@KenyaPower_Care i just bought power 700/- and this is the message i got..Mtr No: 37150618405 ,Token generation failed,Please contact KPLC", "@KenyaPower_care I've just deposited Ksh 450 for meter number 14107557564 but token generation has failed. Please assist", "@KenyaPower_Care hata DM iko na shida Ref:2676244", "@KenyaPower_Care hi how do I send current meter reading through 551?", "@KenyaPower_Care seriously this power issue is too much. Mtr 22120406917 in K.west. Lights out again after being restored at 11.", "@KenyaPower_Care really guys!!all my credit gone on hold.pliz check on mtr#37156304463.bought tokens..couldnt generate so i shuld holla at u", "@kenyapower_care  no power in njoro town acc. No 3523625", "@KenyaPower_Care 8hrs ago i was given this reference no 2684029 and still no lights since yesterday night, please someone do something", "@KenyaPower_Care follow for DM", "@KenyaPower_Care ,No power in the house since morning 04225864752,other line have power", "@KenyaPower_Care  no lights in nyotu ongata rongai a/c. No. 0040919-01 for almost  4hrs please assist", "@KenyaPower_Care Kindly check on your DM, hata hiyo ni ngumu kuangalia", "@KenyaPower_Care we need normal lighting in some area in Sanasana, South B now over 15hrs. The bill to charge for these rages is on the way", "Power in pangani is ON and OFF WHY. It will destroy equipment Who will help? @KenyaPower @KenyaPower_Care @KenyaPowerAlert @ketercharles", "Please address the issues on my dm and advice @KenyaPower_Care", "@KenyaPower_Care sanasana South B is twinkle lights since morning. Wish I had a divorce paper to act on KPTC. I wouldn't hesitate. Act", "@KenyaPower_Care ,whats wrong with your prepaid tokens?why are they taking ages!", "@KenyaPower_Care its sad that the whole day @sanasana we have lights twinkling. On n off. Can someone plis check the area. Tuokolee vyakula", "@KenyaPower_Care  Account No. 04205378443. NO LIGHTS SINCE MORNING! FIX IT PLEASE! NOW!", "@KenyaPower_Care Shukran!", "@KenyaPower_Care just got this message: \"Mtr No: 14244189289 ,Token generation failed,Please contact KPLC\" \nFunds already deducted on Mpesa.", "@KenyaPower_Care Ref: 2676244, Kindly check on your DM. ac: 3430781-01 and note that I am being very diplomatic on this", "RT @KenyaPower_Care: Good evening,Kiserian Ex Matasia is off on a fault.Areas affected: Kiserian,Rimpa,Nkoroi,Rongai,Kandisi.Our technician…", "@KenyaPower_Care acc4245933131. Help us. We've been in darkness too many nights", "@KenyaPower_Care  No assistance has been sent . We wait another week?", "@KenyaPower_Care we have intermittent power. See DM.", "@KenyaPower_Care  A/C 14106813281 no power.. small section of Ruithimitu, surrounding area of Waithaka ok.", "Hey, @KenyaPower_Care  I have accidentally deleted the text with the token numbers for account 14240492059. Please can you resend. Thanks", "@KenyaPower_Care 2442711-02....YOU BLACKOUT PROVIDER, WE DON'T HAVE POWER!!!", "@KenyaPower_Care i had a query concerning my pre pay meter reading -ve and you are kinda slow in replying", "Any updates @KenyaPower_Care @KenyaPower last 2hrs no power Rongai Nyotu Road. Your technicians guys came and did nothing.", "@KenyaPower_Care \nKindly check following my tweet...av already sent the money via the mpesa  but token generation has failed", "Why can't @KenyaPower @KenyaPower_Care @KenyaPowerAlert sort out this perennial problems of power outages in pangani @ketercharles Justtired", "@KenyaPower_Care it was bought by 0711219235 but kplc swrvice indicates the tokken generation has failed when the money has  been deducted", "@KenyaPower_Care It's like i am chasing a mirage.", "@KenyaPower_Care, I misquoted my a/c no. while buying tokens via mpesa, wrote 35151021187 instead of 37151021187. Pliz help to reverse", "@KenyaPower_Care hw much do i have to pay for account 37156129126. I pay for the amount prescribed.Then you give me another amount to pay.", "@KenyaPower_Care @drbenchumo , Why promise what you can't deliver?  4 days without power and all we get is empty promises from your end?", "@KenyaPower_Care my account 04216022873. Token generation has failed. Please sort it out.", "@KenyaPower_Care KE43O5FASV Confirmed. Ksh500.00 sent to KPLC PREPAID  for account 22120341353 on 4/5/16 at 6:50 PM pliz send the token", "@KenyaPower_Care Pls respond asap so I can DM you the details of the location. Pls note, it's not area wide but a phase issue on the block", "@KenyaPower_Care lights are dim here in South B sana sana area, they keep going on and off, since 5am a\\c 22120002989", "@KenyaPower_Care Acc no 14107381528 near chiefs office Imara Daima one phase has gone off and this happens everytime", "@KenyaPower_Care Great! Now token generation failed.", "@kenyapower_care hi i want to replace my meter box to prepay...wot do i need to do. hw long can this process take. r thr any costs incured?", "@KenyaPower_Care @KenyaPower You really are shit. You people don't even bother to reply to tweets or pick calls.", ".@KenyaPower_Care Hi, can you please send technicians to sort out a power outage since 6am today? It's a phase issue, some apts have power", "@KenyaPower_Care Hello would like to know the April bill for the Acc. No. 2665676-01", "@kenyapower_care \"token generation for mtr 22120434901 failed\" fix, please.", "@KenyaPower_Care we have low, flickering lights around plains view, South B since morning..kindly have the issue sorted out.", "@KenyaPower_Care @KenyaPower_Care stop ignoring tweets", "RT @mike_kimani: @KenyaPower_Care hi guys.. no power since late last night.. Acc 2773910. Some houses have power &amp; others not.", "@KenyaPower_Care  hello kindly DM  bill for A/c 3660595-01.Thank you.", "@KenyaPower_Care KE44O1MIDG Confirmed. Ksh5,000.00 sent to KPLC PREPAID  for account 04204491205 on 4/5/16 at 1:23 PM Need my token", "@KenyaPower_Care This clonic power outage @14104590865 kambakia, what's up?", "@KenyaPower_Care please advice in the problem meter number 4034663 -01 no lights", "@KenyaPower_Care JESUS CHRIST!!! Will you guys look into my query", "@KenyaPower_Care will O. rongai have scheduled power outage tommorrow on  thursday?", "@KenyaPower_Care ,one of those rare moments am happy with you,reported an issue that was sorted in record time #Happy", "@KenyaPower_Care Earlier today n u send those units which are not reflecting on my account.. What's the problem", "@KenyaPower_Care \nAm trying to buy the tokens via mpesa bt av received a message  that token generation for a/c 04214895536 can't take place", "@KenyaPower_Care I have an invalid in the house who needs special meals &amp;space \nheater which without power are an impossibility pls help us.", "@KenyaPower_Care Do we expect any assistance....it seems nothing is being done", "@KenyaPower_Care bought token and am getting the reply token generation failed please contact kplc.", "@KenyaPower_Care I did the transaction yesterday through mpesa which was successful but u didn't respond immediately that's when I tweeted u", "@KenyaPower_Care no power at mwitumwiru area along Meru-town to kithaku rd for more than three months now.when will it be sorted?", "@KenyaPower_Care The token u send me earlier today have not reflected on my account 01451124422.the token was 5866_0132_1364_3372_2151.", "@KenyaPower_Care  my metre number 14106919252 the lights disappear and stay for days last week we went three whole days without lights 😔😔", "@KenyaPower_Care 6:20am till now no electricity on Durham Rd Kileleshwa A/C 0012062-03", "@KenyaPower_Care Hi  I live in Imara Daima ,we hve had over 10 power outages in the last week alone on our line,wht  cld be the issue pls ??", "@KenyaPower_Care These past ref nos are abt the same line same issue-2649951,2286091,2506278.When will this issue be resolved fully?", "@KenyaPower_Care no power again at 2150975-05 after the weekend fiasco. Help?", "@AIRTEL_KE is possible to reverse my transaction cz @KenyaPower_Care are not ready at the moment to tackle my concern", "@KenyaPower_Care Kindly restore power in Nkabune TTi Meru and its surrounding.We are getting blackout everyday.Please", "@KenyaPower_Care,some areas don't have electricity in Old Donholm", "@kenyapower_care no electricity 3800534-01", "@kenyapower_care no electricity in my flat 1 phase is out.  Acct no.  3800534-01", "@KenyaPower_Care  @KenyaPower  I'd like to know my account number. What's the process??", "@KenyaPower_Care 2weeks without power mko na dept ya uchawi !!!!", "@KenyaPower @KenyaPower_Care trying to buy tokens via mpesa for 01451218927 and it says failed.", "@KenyaPower_Care @KenyaPower Ben Chumo, we need your services.!! Doesn't it concern you?!5 days.. @ConsumersKenya @UKenyatta", "@kenyapower_care Not visible yet?Here is the account no. 3334118-01.The blackout has been there for hours!!!", "Hey @KenyaPower_Care We haven’t had power since 6.00AM..we have been given this ref No. 2684804 kindly expedite", "@Safaricom_Care KE42O51QI8 mpesa code for transaction @KenyaPower_Care", "@KenyaPower_Care its now one week. Why.", "@KenyaPower_Care power failure 53 min ago account no 2934002-01 need reference no and power restored back ASAP", "@KenyaPower_Care       No power in 3 Rd parklands , kusi lane . Nairobi", "@KenyaPower_Care Please advise what the issue with Ref No 2682645 is. The whole area is without power", "@KenyaPower_Care BLACKOUT TERRORISTS IN KENYA! new slogan  'NORMAL BLACKOUT WILL RESUME AS SOON AS THERE'S POWER'!!! BURE KABISA!", "@KenyaPower_Care what about Upper Matasia, Lekurruki?  96 hours with no power and no effort to resolve!! Tweets ignored since Saturday!!", "@KenyaPower_Care hakuna stima since yesterday Nyerere road Mosque estate Kisumu......Yellow line", "@KenyaPower_Care  my mpesa is deducted but no tokens 14244189453 Cc @Safaricom_Care  I am in darkness", "@KenyaPower_Care @kenyapower @BenChumo are we getting help here or what?? How is this sort of nonsense possible?? @ConsumersKenya", "@KenyaPower_Care no power on Ngao Road. Parklands. A/c: 2004745", "@KenyaPower_Care  Request Meter No: 14252021051, Token: 55726814650102358669, failed", "@KenyaPower_Care Yo! Can I get a response to my tweet...or at least my units?", "@KenyaPower_Care There is no power in Ongata Rongai 4th Avenue. Kindly address this issue", "@KenyaPower_Care bought tokens for 1068 for meter 37151117308 using mpesa KE43NZ642X but no tokens have been credited to the meter", "@KenyaPower_Care Good evening team.\nWe, Changamwe estate's residents, have been in the dark for two days. Please sort us out. Thank you", "@KenyaPower_Care what's the issue? Payment is done. The second message came first https://t.co/kWzEbh6W3c", "@KenyaPower_Care are you guys not seeing our questions or are you choosing to ignore?? https://t.co/aMyAjspLNv", "What's happening @kenyapower_care. My account has gone crazy. It's 22119273583. Saidia jameni!", "@KenyaPower_Care  why is my issue not being addressed", "@KenyaPower_Care i hav an issue with my metre and tokens. I have paid 850 and received 13 tokens. Mtr nos 37150485565. Kindly assist.", "@KenyaPower_Care Kindly help", "@KenyaPower_Care hakuna stima since sato#woodstreet,eastligh.please help?please help?", "@KenyaPower_Care when is the earliest that the meter can be fixed?", "@KenyaPower_Care partial resumption can you check serving a/c number 14107139207", "@KenyaPower_Care ...power outage 2nd Parklands #62828", "@KenyaPower_Care outage in kandisi since 4pm. Please save us from these frequent outages.", "@KenyaPower_Care no elec on 04215279722 pls advise on status", "@kenyapower_care please sort this out, 4 days is Unacceptable", "@KenyaPower_Care Hey i need a response   from you. Tweeted you about power outage in Old Donholm. Can you please give me a feedback.", "@KenyaPower_Care NO POWER ON 2ND PARKLANDS ... total darkness Msanaka Rd ... whats happening?", "@KenyaPower_Care Gachie  along kinanda  road no lights", "Hello @KenyaPower_Care @KenyaPower low voltage issues with line serving meter number 14105669726. Since morning. Sort please.", "@KenyaPower_Care day three of power black out, nothing has been done since reporting on tuesday, please help", "@KenyaPower_Care How can someone retrieve the Token message", "@KenyaPower_Care Hello yesterday I did raise a concern about my accidendal erased token  message. I gave my details  no feedback given.", "@KenyaPower_Care hi ,one power lines in baba dogo ruaraka area,has had a blackout since Monday midmorning (11 am)\nNothing has been done", "@KenyaPower_Care acc:87170 Suswa Rd, 3rd Parklands no power. Pls check asap", "@KenyaPower @KenyaPower_Care trying to buy tokens via mpesa for 01451218927 and it says failed. Whats not happening?", "@KenyaPower_Care power lost on mutati road #64302", "@KenyaPower_Care the problem has not been addressed.Way forward??", "@kenyapower_care Recheck for metre no 60944185.Thanks", "@KenyaPower_Care yes it belongs to S.I Sindani", "@KenyaPower_Care Please check on meter no: 2805551-01 in kileleshwa.We have no power since 9am.Your customercare nos go unanswered all day.", "@KenyaPower_Care  when can we expect power back in mowlem its been two weeks ref no 2679635", "@KenyaPower_Care blackout now at Membley(behind clayworks) Mt No. 4804664-01.KPLC pls resolve the overload on ths line too frequent outages.", "@KenyaPower_Care Your quick response has been appreciated.  Kindly work on the issue ASAP.", "@KenyaPower_Care paid today via Mpesa", "@KenyaPower_Care any luck?.", "Hours later still no response from y'all and the situation is still the same......SMH @KenyaPower_Care", "@KenyaPower_Care 14246317052 reporting power outage in Old Donholm  since morning can you please do something", "@KenyaPower_Care wondered why we import the cement electric poles fromTz?Is it that local companies cant ama they have foreign ingredients?", "@KenyaPower_Care Kitale, Kiungani off since Friday last week, what the hell is going on?! Sort it out!", "@KenyaPower_Care hello power failure 30 min ago account no 2934002-01 kindly give a reference no", "@KenyaPower_Care No power at Kedai close Loresho  ac 0232081", "@KenyaPower_Care Please reply to my tweet!!", "Hello @KenyaPower_Care. Please help. \nBlown transformer. \nAcc# 2310415-01 &amp; all others on our line haven't had power since midday. \nThanks.", "@KenyaPower_Care @KenyaPower @BenChumo , Are we getting lights back today?? And how is this kind of nonsense possible?? @ConsumersKenya", "@KenyaPower_Care Since 10am no power at Montana Hospital, bamburi... What is wrong? This area's economic progress is taking a hit.. Do sth!", "@KenyaPower_Care Kindly assist me with my April  bill 0274501-01.", "Hi @KenyaPower_Care outage again in Kyuna. What's up?", "@KenyaPower_Care we don't have lights at forest road over 24 hours can someone at least respond have customer service etiquette &amp; respond", "@KenyaPower_Care when are we getting power at forest road nxt to your staff houses it's been over 24 hours we have a sick child on oxygen", "@KenyaPower_care i bought tokens for meter no 37152737864 about 3 hrs ago and i have not gotten any feedback please help", "@KenyaPower_Care  kindly send tokens for my meter 14244189453", "@KenyaPower_Care kindly restore electricity my elec Meter Bill is 04220070181.....i live in langata opp uhuru gardens.", "@KenyaPower_Care There is power blackout for A/c 14104542379 near Kingorani Prison-Mombasa..Look into it.", "@kenyapower_care I wish to get the current billing and any outstanding amounts for my account please.", "@KenyaPower_Care @KenyaPower I hope you sort this soon some parts of the neighbourhood have electricity https://t.co/uzfKY0VGKM", "@KenyaPower_Care hi I live in eastlegh sec 3, there has been a black out the whole of this week, and since 8am today no power till now", "@KenyaPower_Care Melissa apartments south B near Sana Sana", "@KenyaPower_Care Power blackout at Gachoka,Embu.Metre no.152425945.Sort the issue", "I have purchased tokens but have not received @KenyaPower_Care", "And just like that @KenyaPower_Care. A day after you fixed a 3 day black out, power goes out again. 😢 Account number 24 3373601-01 Mwihoko.", "@kenyapower_care with that money now i have paid a total of 374  and i received 3.6 token. Whys that?", "@KenyaPower_Care gategi market we are experiencing blackouts since 4pm", "@KenyaPower_Care Saidia Confirmed. \nPayment of Ksh 450 to KPLC TOKENS for account number 01450032964. \nRef. 100293136614 on 04/05/16 at 16:", "@KenyaPower_Care can someone please attend to my DMs", "oya @KenyaPower_Care 14250930980 stima pale kuwa disco lights niaje", "@KenyaPower_Care Since Saturday no power,  twitting now response ,house caretaker calls to you nothing . What now?", "@KenyaPower_Care Confirmed. \nPayment of Ksh 450 to KPLC TOKENS for account number 01450032964. \nRef. 100293136614 on 04/05/16 at 16:53:31.", "@KenyaPower_Care Mtr No : 14252494712 no power since yesterday Utawala Githunguri Agape Area", "@KenyaPower_Care I hope the resolution will be today coz this blinking is a real bother", "@KenyaPower_Care kindly restore power in Githurai 45 ASAP.  Thanks", "@KenyaPower_Care Another night without power.Another case of insensitivity by Kenya Power. Dr Chumo,kindly intervene https://t.co/EyfAbWJ7Vy", "@KenyaPower_Care please work on restoring power in kangemi ac no 14140684193 kindly do it tonight.", "@KenyaPower_Care kindly advise the account/meter no for this serial no. 62113706. Is it 4335122-01?", "@KenyaPower_Care power going on and off at 01450535172 and environs.", "@KenyaPower_Care Please follow me so I can DM you. Thanks..", "@KenyaPower_Care @KenyaPower 1week no power and I pay a monthly standing charge", "@KenyaPower_Care it's now 1week no power complain ref number... 2681863... Plus do something we have business to run @ConsumersKenya", "@KenyaPower_Care I ask that lang'ata civil servants not experience elec supply outage. #itsraining", "@KenyaPower_Care KE46O44PTA Confirmed. Ksh1,000.00 sent to KPLC PREPAID  for account 14107681729 on 4/5/16 at 5:14 PM", "@KenyaPower_Care ????", "@KenyaPower_Care respond to DM ASAP", "RT @KenyaPower_Care: Good evening,Kiserian Ex Matasia is off on a fault.Areas affected: Kiserian,Rimpa,Nkoroi,Rongai,Kandisi.Our technician…", "@KenyaPower_Care I bought tokens at 5:15pm, I have still not received the response.", "@kenyapower_care hi lights flickering on and of in\nsouth b, it damaged all my food in the fridge.\nWhat's the problem.14104282141.", "RT @joewerru: Can't believe am missing @nairobidiaries courtesy of @KenyaPower_Care", "RT @KenyaPower_Care: Good evening,Kiserian Ex Matasia is off on a fault.Areas affected: Kiserian,Rimpa,Nkoroi,Rongai,Kandisi.Our technician…", "@KenyaPower_Care part of Ogembo DCC offices has been in darkness for a week. Efforts to find a solution have been futile. No services so far", "RT @KenyaPower_Care: Good evening,Kiserian Ex Matasia is off on a fault.Areas affected: Kiserian,Rimpa,Nkoroi,Rongai,Kandisi.Our technician…", "@KenyaPower_Care what's happening was given a ref. no.15 hours ago and still nothing has been done.Kindly assist ref. no.2683103", "@KenyaPower_Care this is my meter number 14103931318. We have been having very low voltage of power.fluctuations", "@KenyaPower_Care 3 hours later bado hatuna Stima wazito", "@KenyaPower_Care . This is my meter Nu", "@KenyaPower_Care thank you i got the mobile banking  details and thank for the follow up.", "@ConsumersKenya  tafadhali tuulizie @KenyaPower_Care watatungenezea Stima lini.  Almost 72 hours and they ignore all my tweets. 60817083", "@KenyaPower_Care KE45O2ZNUB Confirmed. Ksh200.00 sent to KPLC PREPAID  for account 14140473035 on 4/5/16 at 3:33 PM Giza inaingia", "Hey @KenyaPower_Care check DM", "@Erickotutouma @KenyaPower_Care No lights again since yesterday after they came back on Monday. Whats happening... Kindly act.", "@KenyaPower_Care @ConsumersKenya  72 hours in darkness and they don't even bother to respond.  Carelessness is an understatement.", "@KenyaPower_Care I will ask again since you've completely ignored my previous tweets.  Tutapata Stima saa ngapi?  Almost 72 hours!", "@KenyaPower_Care bought tokens for 500ksh one hour ago,account 04214968648,am in dark city now,i haven't received my tokens!", "@KenyaPower_Care there's no electricity in the South b sana sana area.", "@kenyapower_care @kenyapower Power has now been off since 2pm after flickering and being dim since morning.", "@kenyapower_care for real since yesterday till now no lights and I reported at 9am in the morning.....surely!!!!! please act upon it", "@KenyaPower_Care Please sort this out for me.  Thanks \"Meter number 22120010099. Token generation failed\"", "@KenyaPower_Care Hi power has been non-consistant half power all day. Kindly look into it. 10404", "@KenyaPower_Care I cannot load tokens on my prepaid meter no. 14243075059. It gives back a FAILED message.", "@KenyaPower_Care @KenyaPower management, that's the minor issue just to assist you. Take a call! #2675029 https://t.co/ppRQMSnSzn", "@kenyapower_care .black out on kamura kiserian area....whatz wrong\nmeter no 04211776325.....0724857019.", "@KenyaPower_Care a/c 2441329-02", "@kenyapower_care ,update on this reference 2682936?the issue is unsolved 24hrs later...did the technical team get lost???", "@KenyaPower_Care off power for 12 hours a/c 2541329-02", "@KenyaPower_Care we have low, flickering lights around plains view, South B since morning..kindly have the issue sorted out.", "@KenyaPower_Care 👇🏿👇🏿👇🏿 https://t.co/qOqg44i2lC", "@KenyaPower_Care reported this for 3 months now at your kitengela office! This is riverside, kitengela! Do sth https://t.co/g2I99wPqg1", "@KenyaPower_Care stima. Off kikuyu road", "@KenyaPower_Care u said ur tech are on site since 7am till now? Surely?", "@KenyaPower_Care I want tokens this my Trans ID: 1605071618670 account 14252709663", "@KenyaPower_Care anything??", "@KenyaPower_Care dim power since morning, kulikoni? A/c 2452278", "@KenyaPower_Care bought tokens thro mpesa 0720788260,3 days ago and have not received them. Mtr 14251509700.please help.", "@KenyaPower_Care I purchased tokens via Mpesa but am yet to receive my units? More #14228938321", "@KenyaPower_Care I bought some tokens via Airtel bado sijapata response what should I do!?", "@KenyaPower_Care @KenyaPower ... And it's ironic that your meter guy was here on foot...? Where are your techs? Or are you just ignoring us?", "@KenyaPower_Care hey! No power in Pangani since yesterday at 10PM.... What's  going on?", "@KenyaPower_Care tried 2 buy units za 500, over a month ago it dint work n money ws deducted so the transaction has been pending until today", "@KenyaPower_Care no power MTR no. 22120074269 at kahawai west around PCEA", "@KenyaPower_Care @KenyaPower nothing yet.. We can see the faulty lines which your tech on Monday left unattended. Who else can do assist us?", "@KenyaPower_Care no power in my area. Ac 3630300.", "@KenyaPower_Care hi. I payed for the meter via Mpesa over an hour ago, but haven't gotten the message with the pin. Pls assist ASAP.", "@KenyaPower_Care 500sh sent to invalid prepaid acc 15105879978.transaction id KE32NVNT3S..0729314782...kindly reverse money.plis", "@KenyaPower_Care 500sh sent to invalid prepaid acc 15105879978.transaction id KE32NVNT3S..0729314782...kindly reverse money.", "@KenyaPower_Care kindly follow up on my metre no 04214893929,I have been in darkness since Monday!!0726375875..very dissapointed..", "@KenyaPower_Care unstable elec since 4am. Kindly advise progress since all your lines are not going thru . a/c no: 01461023137", "@KenyaPower_Care power blackout at mathari.mental hospital account. No 238561 kindly restore power we are in darkness", "@KenyaPower_Care @fndaga 2238030 still no power 2nd day. What is happening. Still your team not worked on issue. @KenyaPower @dailynation", "@KenyaPower_Care you restore power then it goes off we are losing on business.", "@KenyaPower_Care engineer for #kplcrongaibranch help us.", "@KenyaPower_Care we cannot pump water into our homes, we have thrown away a lot of food. No response from #kplcrongaibranch", "@KenyaPower_Care 😒😒😒 what's this on and off thing?", "@KenyaPower_Care technicians in Kitale town b serious power at transmatt and safaricom care on and off many times", "@KenyaPower_Care they are now not picking up our calls #kplcrongaibranch", "@KenyaPower_Care acc-3808697-01. Contact 0733194434", "@KenyaPower_Care  bought units at 3pm but I have not received the token. Mobile 0738480446 metre no. 01450658081. What's up?", "@KenyaPower_Care rongai branch employees came and took down the rotten pole on Sat 30th and have not yet replaced it ngong kiserian", "RT @atlentkenya: @KenyaPower_Care Hi. We have not had power at Hunters - Kasarani, ths is the 4th day. Kindly do smthn. Acc No. 01451155269", "@KenyaPower_Care its not jus my place with a black out, but the whole estate...", "@KenyaPower_Care your rongai branch is not helping us. No elec since Saturday 30th", "@kenyapower_care hi lights flickering on and\nof in south b, it damaged all my food in the\nfridge. What's the  problem.14104282141.", "@KenyaPower_Care hi lights flickering on and of in south b, it damaged all my food in the fridge. is there a problem.14104282141.", "After how many hours should @KenyaPower_Care Compensate me for a blackout. That bill was passed?", "@KenyaPower_Care KE40O4380Q Confirmed. Ksh1,500.00 sent to KPLC PREPAID  for account 01450284987 \n Been waiting for token", "@KenyaPower_Care what time is the electricity coming back in Lavington / James Gichuru area? We've had no electricity since 10 today.", "@KenyaPower_Care Thanks. Any idea how long it will take? We still have no power.. running to more than 12hrs..", "@KenyaPower_Care  Hi we do not have power in South B sore drive account  01450138571 kindly assist. Thanks"]