["@Zuku_WeCare @ZukuOfficial my services are down. Account 569008. Please advice. Thanks.", "Have you heard about our brand new TV shows on #AMCSERIES! Watch more here\nhttps://t.co/pyH4jRLKmX @StarTimesKenya @ZukuOfficial", "@ZukuOfficial @Zuku_WeCare \nErratic connectivity this afternoon.  #62942", "@ZukuOfficial Internet service back to 86746", "@ZukuOfficial still slower than normal.... please fix it asap", "Taking a moment to show some mad love to @ZukuOfficial. You've come thru for me again with an impressive level of efficiency. Thank you!", "Kindly Dm your business number to me i pay my subscription for the month. @ZukuOfficial", "@ZukuOfficial Hi. 48 hours is totally unacceptable. You need to refund us for the constant downtime. Please tell me who I can escalate to.", "@ZukuOfficial yes all is well now. Thank you.", "@ZukuOfficial when I test using speed test its barely 0.1 .....", "Hi @Anjella_Nancie!  No worries! @ZukuOfficial will be  around if ever you decide to switch it up and enjoy #AMCSERIES ch 229 :D", "@ZukuOfficial @ZukuOfficial Why is it when it gets to 5pm the net speeds become slow??Are u doing it deliberately?@ConsumersKenya @CA_Kenya", "I know about @ZukuOfficial I use their Internet just not pay TV but good stuff @AMCChannels  https://t.co/rvKUmVkdQO", "Don't miss out! Your movies for next week on #AMC Love African movie? Love #AMC @LycaTV https://t.co/nQwJYVYt7b  @consattv @ZukuOfficial", "Hi @Anjella_Nancie @glangiri ! What country are you based in?  @ZukuOfficial could maybe help you", "@ZukuOfficial thank you,  i need confirmation when your connection will reach tasia complex. Kindly confirm this for me. \nHave a good day.", "@ZukuOfficial the thing is,you call,i give you the number of the caretaker/landlord,you get directions on how to get here,BUTSTILLDONOTHING!", "@ZukuOfficial hallo,i reside at ruaka and despite my constant applications for connection you have assumed me.Its now six months,whats up?", "@ZukuOfficial hi , a/c no 109382 no Internet connection + cable stations are down too . What's the issue ?", "@ZukuOfficial  I have no internet connection plus no t.v signal. Kindly check my account number 114044.", "@Zuku_WeCare @ZukuOfficial Hello, can't seem to connect my account to your web portal a/c 193585", "No connection 😡 @ZukuOfficial", "RT @AMCChannels: #GbosaWeekends #AMCSERIES @ZukuOfficial  @Naijapals  #Drama @MediaGuide_NG  @Extratainment  @THEBUZZTVSHOW https://t.co/fj…", "RT @AMCChannels: #AMCSERIES today  at 1700GMT  Top Kenyan drama Stay ! Starring @reptileland @glangiri @ADELLEO   @ZukuOfficial https://t.c…", "#AMC Red Carpet today #AMCSERIES 1700GMT! All the glitz &amp; glam of the latest Nollywood premiere!  @ZukuOfficial https://t.co/YNrUSY5GbU", "#AMCSERIES today  at 1700GMT  Top Kenyan drama Stay ! Starring @reptileland @glangiri @ADELLEO   @ZukuOfficial https://t.co/HqLmKBF6fO", "@ZukuOfficial kindly assist me with your number......", "@ZukuOfficial no internet on Westlands acc no 54700", "#GbosaWeekends #AMCSERIES @ZukuOfficial  @Naijapals  #Drama @MediaGuide_NG  @Extratainment  @THEBUZZTVSHOW https://t.co/fjzygLjoAg", "@ZukuOfficial Will it be rolled out any time soon? If not, is there an alternative you can advise?", "#GbosaWeekends #AMCSERIES @ZukuOfficial  #Naija #Glasshouse #VictorOlaotan https://t.co/TNjTMbKxUi", "@ZukuOfficial  ur customercare rep was supposed to put me in contact with ur sales team hrs ago bt am still waiting. From miritini, mombasa", "RT @OeriDamaris: @ZukuOfficial @Zuku_WeCare sorted. Gracias", "@ZukuOfficial @Zuku_WeCare sorted. Gracias", "RT @AMCChannels: #GbosaWeekends #AMCSERIES @ZukuOfficial  @nolly #TV @sodas_popcorn  @Naijapals https://t.co/XVqTVqanja", "Heartbreak Hotel 1630GMT today on #AMCSERIES @ZukuOfficial  @IfactoryLive  @Naijapals https://t.co/LPRE8iF2AH", "@Zuku_WeCare , @ZukuOfficial All I need you to tell me is how my package charges JUST CHANGED! But u too arrogant to respond #CampusIconTBT", "So, @ZukuOfficial @Zuku_WeCare u have decided YOU WANT TO ROB Me?? #CampusIconTBT #SafaricomKPMGScandal https://t.co/u7MWSIzrJn", "#GbosaWeekends #AMCSERIES @ZukuOfficial  @nolly #TV @sodas_popcorn  @Naijapals https://t.co/XVqTVqanja", "@ZukuOfficial Wi-Fi has been on and off consistently. please assist Acc No 147222", "#GbosaWeekends #AMCSERIES @Zukuofficial  #Gbosa https://t.co/28HpJyPLvu", "@shalishambi @CoutureAfrica @DermTimesNow @Kipchumbamurgor @MedscapeDerm @wgkantai @ZukuOfficial", "@ZukuOfficial @Zuku_WeCare. Good afternoon, kindly but urgently check my Internet connection.", "@ZukuOfficial @Zuku_WeCare am still waiting for your communication", "@ZukuOfficial we cant talk everyday and do nothing!", "@ZukuOfficial\nZuku.Trusted providers of great hi-speed OFFLINE services for Ksh4800/ month only!!! Love you guys. 😒 https://t.co/SafWs5OESy", "This cute offline game is the only reliable thing with @ZukuOfficial internet nowadays. Thanks zuku. You do care 😒 https://t.co/fFtHjMtqv2", "@ZukuOfficial @Zuku_WeCare and what are you doing about it? Are you going to 'resolve' it when you feel like it?", "@Kawiria @ZukuOfficial So am not alone...been paying for 15mbps and getting 1mbps", "@Kawiria @ZukuOfficial Its getting worse and customer service never helps!", "@ZukuOfficial How long will it take to handle it? Down again. No consistency in service!Get your act together!", "@ZukuOfficial it's ok now. Must have been temporary. Thanks", "@ZukuOfficial i want the 1200 a month WiFi service. I live along langata south road few 100 mtrs from Nairobi academy can I get it and how", "@ZukuOfficial my connection is down", "RT @Kawiria: But the speeds for @ZukuOfficial are really always suspect. Why increase charges &amp; you're not ready to offer what you're claim…", "@ZukuOfficial done", "@ZukuOfficial plus I can't DM coz apparently you haven't followed me.", "@ZukuOfficial that's not the only issue I have. I can't get any connection with RJ45 cable either.", "@ZukuOfficial 119558? Anything? Anyone? 🤔🤔🤔🤔", "@ZukuOfficial @ZukuOfficial hi. Is there a connection problem in Jamhuri estate? Can't seem to get internet.", "@ZukuOfficial hi. Is there a connection problem in Jamhuri estate? Can't seem to get internet.", "@ZukuOfficial natudesappoint. I was waiting for teresa #zukuNolly mnarudisha ya kitambo.", "@ZukuOfficial We're down 100596. Kindly resolve.", "RT @Kawiria: But the speeds for @ZukuOfficial are really always suspect. Why increase charges &amp; you're not ready to offer what you're claim…", "@ZukuOfficial check @dionbryne's tweet, he already did it. We'll confirm again today evening &amp; hope it's what it's meant to be - 15mbps.", "@zukuofficial tired of complaining about no internet always off when I need it... so I guess should sort myself out can't keep on like this", "@ZukuOfficial and then the speeds go up only when you complain 🙄That's really savage of your operations.", "@ZukuOfficial we've never experienced this 15mbps you keep advertising &amp; yet we pay for it. Having consistent Internet is a miracle.", "But the speeds for @ZukuOfficial are really always suspect. Why increase charges &amp; you're not ready to offer what you're claiming to offer?", "RT @Kawiria: What was that @ZukuOfficial was saying about 15MB again?  https://t.co/LquUjy9isp", "RT @Kawiria: What was that @ZukuOfficial was saying about 15MB again?  https://t.co/LquUjy9isp", "What was that @ZukuOfficial was saying about 15MB again?  https://t.co/LquUjy9isp", "@ZukuOfficial Rebooted again. No service. 86746. *DA 0835 hrs", "@ZukuOfficial @Zuku_WeCare No internet service at 86746. TV signal has also been erratic last 72 hrs. I have had ZERO Internet last 3 days.", "@ZukuOfficial @Zuku_WeCare is how? I need to work *frustrated *..no Internet at all", "@Zukuofficial @Zuku_WeCare ni tumeishana friends ama? You don't respond to my tweets and the internet really bad nowadays", "@ZukuOfficial hello was wondering what are uploads speeds of 4mb package as am getting 0.1", "@ZukuOfficial @Zuku_WeCare STILL no Internet service at 86746.   *WHY? Ref:#203814", "@ZukuOfficial 17 hours and counting. If you tell me to restart the modem one more time I might start using expletives", "@ZukuOfficial how I wish there was performance to measure! Acha niende nikaombe internet.", "@ZukuOfficial net can not even download and we upgraded! What is happening ac121634", "@ZukuOfficial last contacted No reply! Always told a site visit will be done no one come. Zuku net is so frustrating!!!", "@ZukuOfficial k8ndly helpnet always slow have called no help!!! Ac121634 tired!!", "@ZukuOfficial good morning. No internet since yesterday for a/c 116946.", "@ZukuOfficial the service is super slow when it isn't completely down. I suggest you send a team to the area to assess resolve the issue.", "@ZukuOfficial service to acc.14414 has been appalling over the last couple of days. Despite talking with your tech team today.", "@ZukuOfficial Working Perfectly. Thank you again for your assistance and quick response to the matter.", "@ZukuOfficial Hi, kindly follow back i need to DM thanks", "RT @ZukuOfficial: @Arthurnyoiks @Bobbysyoks Reset was done Arthur. Lovely night. *MA", "@ZukuOfficial can I only get WiFi without TV channels", "@ZukuOfficial This is annoying.. 3rd wk stil no help. Still getting 1mb/s yet paying for 15mbs. Custmer service not helpful at all!", "@ZukuOfficial @dee_ene_gee lol all the best. I'm sure this will be of much help .", "@javiermunzala 😂😂'  @ZukuOfficial", "@ZukuOfficial Slow unstable internet, please fix it a/c139664", "@ZukuOfficial", "@ZukuOfficial this is the message I get trying to test the data speeds. Cannot even load your own page. https://t.co/HI3pRUXzZQ", "@ZukuOfficial stop playing with my money i expect quality service i don't pay in installments i expect continuous internet connectivity", "@ZukuOfficial A/c 167694 no internet for the last 1 hour.", "@ZukuOfficial", "@zukuofficial you guys are hopeless....", "@Malkia__ @ZukuOfficial @Zuku_WeCare could be interference from neighbor's wifi. Ask zuku to change your band", "RT @EbruTVKenya: We are live on @EbruTVKenya tune in on Channel 96 @GOtvKenya Channel 102 @StarTimesKenya Channel 17 @ZukuOfficial https://…", "@ZukuOfficial It has been acting up daily. Please confirm the booking for tomorrow and let me know the time.", "@ZukuOfficial hi. It was up but it's down again. Lilian says she cannot call out. We agreed a technician will replace the modem tomorrow.", "@ZukuOfficial dude, it's been more than 10 hours now", "@ZukuOfficial  even after paying on time", "@ZukuOfficial why is this happening??!", "@ZukuOfficial team, kindly follow back for DM.", "@gishungwa @ZukuOfficial tomorrow am checking out the sister to my neighbours wife🙊", "@ZukuOfficial I DMed but 0 response.. I've called but it only worked for 2 seconds then back to 0", "@ZukuOfficial connection is still bad!  Can't even use whatsapp with it!!!!", "@javiermunzala my dear you are the victim. Draft those divorce papers. @ZukuOfficial", "@ZukuOfficial it'd working now thanks. How come evenings it usually goes down?", "RT @Racetophiney: @Superjohna07 @Arthurnyoiks @ZukuOfficial yes they do. Even my wife's  was changed some few days ago n as we speak she is…", "@ZukuOfficial @Zuku_WeCare I am depressed about this.", "RT @Racetophiney: @Superjohna07 @Arthurnyoiks @ZukuOfficial yes they do. Even my wife's  was changed some few days ago n as we speak she is…", "@ZukuOfficial @Zuku_WeCare kindly do something.We can't have fast net in one corner and the other corner slow.The whole thing should be fast", "@ZukuOfficial my internet is unacceptably slow. .. this is ridiculous! My a.c. number is 60213.", "@ri_yaz @ZukuOfficial @Zuku_WeCare I am depressed lol", "@gishungwa @ZukuOfficial 😷😷😷 and am not the one abusing!", "@Superjohna07 @Arthurnyoiks @ZukuOfficial yes they do. Even my wife's  was changed some few days ago n as we speak she is with her parents!!", "RT @EbruTVKenya: We are live on @EbruTVKenya tune in on Channel 96 @GOtvKenya Channel 102 @StarTimesKenya Channel 17 @ZukuOfficial https://…", "@javiermunzala you are in an abusive relationship with @ZukuOfficial 😂😂😂", "I wish for a day which I won't have to suffer using your net. It's very slow @ZukuOfficial @Zuku_WeCare", "RT @Superjohna07: Hi Zuku, can you change Wife passwords? :-) \"@Arthurnyoiks: @ZukuOfficial hi, how can I change my wife password?\"", "@ZukuOfficial I have already made a call.. And I have been assisted", "RT @Superjohna07: Hi Zuku, can you change Wife passwords? :-) \"@Arthurnyoiks: @ZukuOfficial hi, how can I change my wife password?\"", "We are live on @EbruTVKenya tune in on Channel 96 @GOtvKenya Channel 102 @StarTimesKenya Channel 17 @ZukuOfficial https://t.co/Bo4cwjPC3a", "RT @Superjohna07: Hi Zuku, can you change Wife passwords? :-) \"@Arthurnyoiks: @ZukuOfficial hi, how can I change my wife password?\"", "Hi Zuku, can you change Wife passwords? :-) \"@Arthurnyoiks: @ZukuOfficial hi, how can I change my wife password?\"", "@Trackmann @ZukuOfficial internet is a big con game. Speeds that cannot navigate twitter pages #BureKabisa", "RT @Trackmann: @ZukuOfficial speed still slow tonight. Got 3 Mbps on a wired test. Paying for 50 Mbps", "@ZukuOfficial poor service plus false promises... receiving payments for service not offered! #Lookin4aHarshtag for this.", "@Bobbysyoks haha. I meant WiFi password. Phone just decided I'm married  @ZukuOfficial", "@ZukuOfficial hi, how can I change my wife password?", "This is now a fucking joke,I hope everything that can go wrong for you does🖕🏻🖕🏻@Zuku_WeCare @ZukuOfficial go to hell https://t.co/kaDOEwT1L5", "@ZukuOfficial Evening\nAcc No. 094605 been offline since yesterday evening (No internet connection).Kindly check on it", "@ZukuOfficial your speed sensor is unable to connect https://t.co/5sAvTDSSPx is not available\nhttps://t.co/5sAvTDSSPx", "@ZukuOfficial *MA I have had the problem for 3 weeks. I was told its an individual issue. Greatly disappointed but ty for your response MA", "@ZukuOfficial is there a 30% discount offer for the Premium package?", "@ZukuOfficial @Zuku_WeCare well done, you fixed my internet for an hour #NewRecord #ihateyou please fix your broken service", "@DStv_Kenya why are you doing this to me? Sitaona tv, sindio? If you don't send a technician to my house I am switching to @ZukuOfficial", "@ZukuOfficial what's going on with your Internet in kilimani? Slow the past week", "@ZukuOfficial @Zuku_WeCare Please explain why you've taken away from your contact center agents the ability to call customers back.", "@ZukuOfficial kwanza siku hizi ni kulenga my requests, second what's up with your shifty Internet nowadays?", "@ZukuOfficial wtf!!  Why can't you fucking respond to my request from one hour ago???", "@ZukuOfficial @Zuku_WeCare No Internet. Please check 178353.", "@ZukuOfficial ya now it's Back.Thanks", "@zukuofficial pliz check DM", "@ZukuOfficial https://t.co/U3MFolpAbn", "@ZukuOfficial feeling cheated for weeks! Kila siku texts za repair in your neighbourhood! 15mbps! Really! Can't even receive  a whatsapp txt", "@ZukuOfficial restarted as per your instructions. Still the same.", "@zukuofficial its ok now bt only Emmanuel tv still scrambled", "no tv signal and Internet. @ZukuOfficial @Zuku_WeCare", "@ZukuOfficial Acc 124255 is slow. Work on it. Two people can't stream stuff at the same time!!", "@ZukuOfficial @Zuku_WeCare will you zuku bastards fix the internet or not?", "@ZukuOfficial hi pliz reconnect my acc 181641 been waiting since morning", "@Zuku_WeCare @ZukuOfficial unstable connectivity.... persists", "@ZukuOfficial thanks all is well", "@ZukuOfficial back to my usual. Kweli hii ni ujeuri mnanifanyia. https://t.co/c7glin5MQO", "@ZukuOfficial hd*", "@ZukuOfficial nothing yet", "@ZukuOfficial @Zuku_WeCare", "@ZukuOfficial your website says I'm getting 30 yet I can't load a he YouTube video, sorry but I don't trust it I'll stick with oklaa", "@ZukuOfficial it's improved but I still can't load a had video on YouTube", "@ZukuOfficial please help me change password for 177808!!  if you don't mind", "Dear @ZukuOfficial my internet connectivity is down.Kindly do the needful acc number 193113", "Ay @ZukuOfficial what's with the all day internet outages? 2 days already this week - and it's only Wednesday!", "@ZukuOfficial I would like to change my wifi password..  Please call me!!", "@ZukuOfficial Hi i am unable to download. Kindly reset my account\n My account 126741", "@ZukuOfficial *MA. If I wanted to give back your stuff. How do I go about it?", "@ZukuOfficial please activate my account", "@zukuofficial thanks its on", "@ZukuOfficial  whats up network is down kabisa a/c 140953", "I will kindly ask you fix this, acc no. 77512 @ZukuOfficial @Zuku_WeCare https://t.co/ODbcqo3eVK", "@ZukuOfficial hey, please open my account", "@ZukuOfficial the channels are there but scrambled.", "@Zuku_WeCare @ZukuOfficial no net now&amp;you keep sending reminders...i cant even count the NO. of complaints from my end&amp;you expect payment 👎", "@ZukuOfficial A/C 69806. 3 weeks of intermitencies and now no connection. Technicians came and did nothing. Get your stuff out of my house.", "@ZukuOfficial @Zuku_WeCare Still NO service at 86746. Yes, I have ''rebooted''. WHY*", "https://t.co/BbzwJZrUhH #June movies on #AMC! ! @BambaTVKenya @consattv @ZukuOfficial @StarTimes_Ng @StarTimesUganda Sodas&amp;Popcorn", "@ZukuOfficial 66314", "@ZukuOfficial Hie can you check this account 900982 has been disconnected(scrambled),but it was paid for this month", "@zukuofficial  my phone No is +255754445467", "RT @ZukuOfficial: @nahashon_o Hi Nahashon,please send us the payment details and we will transfer the funds for you. *MA", "@zukuofficial I happen to have deleted the SMS coz I don't normally keep mpesa msgs", "@ZukuOfficial yes it is. Patiently waiting for service to be restored.", "@ZukuOfficial when do you suppose you'll have sorted it out?", "@ZukuOfficial I have lost reception of KTN, NTV, KBC, CITIZEN n KTN NEWS. What's up?", "@ZukuOfficial plz I did make payment to a wrong a/c my a/c is 745355 but I paid to 735455", "@zukuofficial your paybill number?", "No internet for three days in our offices...and Zuku won't do anything about it....\n:-(\n@ZukuOfficial @Zuku_WeCare", "Now Playing on #HELLOAFRIKA is @wizkidayo with Baba Nla \n\nTune in on @ZukuOfficial ch. 971/ https://t.co/DTm5JlsoLP https://t.co/lOgkBEW1OJ", "@ZukuOfficial I have. And please, I have been on this troubleshooting thing for more than 72 hours. I feel nauseated. Get it or drop it.", "@ZukuOfficial which number? The dead one or one from a service that works?", "@ZukuOfficial account number 92589 please check and fix", "@ZukuOfficial @Zuku_WeCare hey. My wifi isn't working please help. Account number 9226. Thanks.", "@ZukuOfficial What a business you run. You must be having very desperate customers. You either send your people to sort it out or", "@ZukuOfficial then you unashamedly order me to take the dead block (phone) to a Zuku shop?? I close my business to attend to that?", "@ZukuOfficial rubbish. Nothing has come out of these 100's of resets and reboots. Now that we have done it, still the phone remains dead.", "@ZukuOfficial Check DM", "@ZukuCare @Zuku_WeCare @ZukuOfficial intermittent services since early morning. Please stabilize the link!", "@crisuits My rlshp with @ZukuOfficial  is awesome. Just loving it. :)  :)", "Oh really? Have you tried getting into a relationship with Zuku @ZukuOfficial @Zuku_WeCare", "@ZukuOfficial I am yet to receive the form. Was to be sent to me yesterday.", "@ZukuOfficial there is nothing u can do?", "'“Class three is so hard!” I wanted to say, “Oh really? Have you tried getting into a relationship with @ZukuOfficial?'\"~ @bikozulu", "@ZukuOfficial thanks! Connecting now. Thank you.", "@ZukuOfficial @Zuku_WeCare No service at 86746. Rebooting as advised not working.", "@ZukuOfficial it is powered. In fact I can see all the other wifi connections around me", "@ZukuOfficial no change. Rebooted twice.", "@ZukuOfficial Had requested some time back if you provide internet in Mathare North. In real need of it.", "@ZukuOfficial @Zuku_WeCare No service @ 86746", "@ZukuOfficial hi. Please check on the signal here", "@ZukuOfficial I have been waiting for an email from you for more than 24 hrs now. How long will it take you to fill a movement form n send?", "@ZukuOfficial nimeenda kuomba internet. Nikirudi I will go through the process AGAIN and tweet.", "@Zuku_WeCare @ZukuOfficial Please re-establish my internet on ZUKU112420. I need to do some urgent work. #internetDown #NoInternet #zero!", "@ZukuOfficial Asking for a friend....Do you guys offer internet at syiokimau ..Great wall apartments?", "@ZukuOfficial hi. No internet since yesterday 6pm. A/c no:97782. Any progress on the issue?", "@ZukuOfficial there is no internet today", "@ZukuOfficial the chanels hang alot its affected by small rain while other decorders are oparating", "@ZukuOfficial. Please recconect my account 322637 kindly now..", "@ZukuOfficial For the past few days internet connection has been on and off. What's the problem? A/c 87802", "@ZukuOfficial we want someone to install the Wifi for us how do we get to it?", "My internet has been down since Sunday. @ZukuOfficial @Zuku_WeCare", "@ZukuOfficial please reset fiber phone a/c 135633 and please forward the phone number", "@zukuofficial yes, I have tried but there is no change", "@ZukuOfficial will I ever truly enjoy the services I am paying for?", "@ZukuOfficial at least follow the conversation and have consistently in your responses. Everything was just ok till you came up with 15mbps!", "@Zuku_WeCare @ZukuOfficial  So I pay Kshs 5800 for 30 MBps and this is what you offer @BoogieBenzzDJ @FestoRenga1 RT https://t.co/gZOWzUthNk", "@zukuofficial it affects all the chanells account no. 541038", "@ZukuOfficial yes the phone is going through from the callers side but on our side its not ringing.", ".@ZukuOfficial is there some problem with your service in Msa ,acc 154660 ? @Zuku_WeCare", "@ZukuOfficial  No zuku service in south b - sore drive since yesterday 😟😟", "@ZukuOfficial Awaiting service!", "@ZukuOfficial Morning do you cover Naivasha road", "@ZukuOfficial @Zuku_WeCare check DM", "@Zuku_WeCare @ZukuOfficial. Now what's happened after a few days of service?", "@ZukuOfficial 165304 the problem has never been solved. Takes minutes to access a website. Don't believe you are giving advertised speeds.", "@ZukuOfficial that is accurate.  However the speeds are about 5Mbps at prime time  (7-9pm). Later in the night is when they hit &gt;20Mbps.", "@ZukuOfficial hi, what the name of your android app?", "@ZukuOfficial Acc 187484. Really disappointed with your service the last two weeks. Really really disappointed... even now?", "@ZukuOfficial cool thanks", "@ZukuOfficial I just checked your coverage of coast and sadly you cannot connect me so till later when you coverage increases I guess", "It's about time another ISP offers home internet. I am honestly tired of @ZukuOfficial Ever since the upgrade,Internet speed is too slow.", "@ZukuOfficial confirmed.", "@ZukuOfficial Guys I'm really getting tired of the interruption! Wifi is always down!! Please find a lasting solution!! Ac: 167162", "@ZukuOfficial @Zuku_WeCare kindly check my Internet connection. Thank you in advance", "RT @EbruTVKenya: Café Ngoma On @ZukuOfficial channel 17, @StarTimesKenya channel 102 and @GOtvKenya channel 96 #SoulfulTuesday https://t.co…", "Café Ngoma On @ZukuOfficial channel 17, @StarTimesKenya channel 102 and @GOtvKenya channel 96 #SoulfulTuesday https://t.co/qQuhy19KwC", "What the actual fuck is this? I can barely load Google @ZukuOfficial @Zuku_WeCare 🖕🏻🖕🏻😒 https://t.co/g8WP0srcYk", "@ZukuOfficial how can net be so bad yet I'm supposed to be on 15mbps net .unacceptable service! https://t.co/X3GIHaLUxA", "@Zuku_WeCare @ZukuOfficial Not even the TV service is operating", "@ZukuOfficial Issue sorted! Thanks to Geoffrey &amp; @odungareh Asanteni sana!", "@Zuku_WeCare @ZukuOfficial My internet has been very slow from around 10am. What's the problem? Can't even load a page!!! \nAcc no 187809", "@ZukuOfficial is there a serious Internet downtime in Umoja? Been having issues since yesterday and wondering y u ain't working on this.", "The Internet  today  seem  to be on  and off at Dagorretti area,  what could be the problem. @ZukuOfficial @Zuku_WeCare", "@ZukuOfficial @Zuku_WeCare  kindly check my account 182077 the Internet is too slow", "@ZukuOfficial Hey!  Having a challenge with WiFi, phone &amp; laptop can't detect it??", "@ZukuOfficial my internet connection is down, is there a problem on ur end. My acc no. 6950", "This is why my KD is dropping. This is the service @ZukuOfficial gives https://t.co/8JnjrLCQQV", "@ZukuOfficial speed still slow tonight. Got 3 Mbps on a wired test. Paying for 50 Mbps", "@ZukuOfficial my account number is 119376", "@ZukuOfficial @AlexBosire am ok", "RT @iCabway: #CelebrityKitchenRaid  | @Chefalilartiste  | @ZukuOfficial Entertainment Channel 100", "@ZukuOfficial I want the the infinite 15 package. How soon can I get the setup in Kahawa Sukari?", "#CelebrityKitchenRaid  | @Chefalilartiste  | @ZukuOfficial Entertainment Channel 100", "@ZukuOfficial yeah, it's all good.", "@Zuku_WeCare @ZukuOfficial  ac. 165583 no service this evening, what is the problem?", "@ZukuOfficial Please reset this account for me 181959", "@ZukuOfficial What are the setup charges?", "@Zuku_WeCare @ZukuOfficial i'm using my data bundles &amp; yet i subscribe to ur poor internet services #shame @ConsumersKenya @CA_Kenya", "@ZukuOfficial what's going on with the Internet? Am supposed to be getting 15mbps download speed but am getting 3 https://t.co/yf4oYS0swR", "@Zuku_WeCare  @ZukuOfficial  Persistant slow speeds experienced on account 166202 even after soughting it out jana after calling", "@Zuku_WeCare @ZukuOfficial is it possible to move from triple play to tv only?  Ac 4692", "@ZukuOfficial @Zuku_WeCare Your internet speeds suck....You guys need to wake up #92296 @ConsumersKenya @CA_Kenya", "@ZukuOfficial hello, I was changing chanels on my zuku decoder and suddenly it stopped showing full screen what can be the problem?", "@ZukuOfficial net speed to ooooooooooh slow", "@ZukuOfficial help this nigga he needs wifi https://t.co/U9KylkJJt5", "@ZukuOfficial i haven't had a connection since  yesterday. Please advise. 184195", "@ZukuOfficial hello activate my decoder 471850. Plz", "@ZukuOfficial @Zuku_WeCare sometimes your speeds are embarrassing. Kindly check. A/C 188907", "@ZukuOfficial so no need to reboot. Anyways we already did that and still not working", "RT @AMCChannels: https://t.co/cVJWGyN4Am   #June movies on #AMC! ! @BambaTVKenya  @consattv  @ZukuOfficial @StarTimes_Ng  @StarTimesUganda…", "@ZukuOfficial ok I don't have a remote. What do I need to do to get the new decoder?do I pay?how much? We are locked out of tv watching", "@ZukuOfficial Seriously you guys I have just become your client n no Internet for 2days now.", "@ZukuOfficial since last month your internet speeds have become slower. I aint the only one complaining. Whats going on?", "@ZukuOfficial i made a payment via pesapal. https://t.co/as6NTM0ph0", "@ZukuOfficial you are taking me again through the same???", "@ZukuOfficial yesterday I had two of your support who took me through a wild goose chase and still left me phoneless!", "@ZukuOfficial why should go through a process that has been directed me a thousand times in the past?", "@Zuku_WeCare @ZukuOfficial upper hill 155380..\nNo internet. Help", "@ZukuOfficial you have even disconnected my net after reporting this.", "https://t.co/cVJWGyN4Am   #June movies on #AMC! ! @BambaTVKenya  @consattv  @ZukuOfficial @StarTimes_Ng  @StarTimesUganda  @sodas_popcorn", "@ZukuOfficial @Zuku_WeCare getting pathetic internet speeds.", "My phone has been off for more than 3 months. @ZukuOfficial has given me blank promises. @ZukuOfficial Ac.145689. I need an answer.", "So, @ZukuOfficial has decided to give my phone case a blackout! Ac.145689. I need an answer.", "@ZukuOfficial @Zuku_WeCare still zero reception. What is going on?", "@ZukuOfficial i use pesapal method", "@ZukuOfficial here by is a transaction details", "@ZukuOfficial https://t.co/2j6GZLMJRp", "@ZukuOfficial thank you, it's now connected", "@ZukuOfficial pliz change this account 304751 to zuku smart after due date", "@ZukuOfficial KOECH, zuku160869", "@ZukuOfficial Okay.", "@ZukuOfficial thank you I will be waiting for your call", "@Zuku_WeCare @ZukuOfficial things are real quiet over here.", "@ZukuOfficial hello.please kindly activate my acct to zuku classic asia.i make a paymentbof 90500.00 MKW via pesapal.", "@Zuku_WeCare @ZukuOfficial sent you a dm. Some issues again.", "@ZukuOfficial pliz check link of zk160869", "@ZukuOfficial ACC 126821", "@ZukuOfficial you guyz disappeared", "@ZukuOfficial done that a couple of times please check what the problem is", "@ZukuOfficial the balance has been paid now", "@ZukuOfficial still no change😭 142284", "@ZukuOfficial 62131", "check DM @zukuofficial", "@ZukuOfficial paid for this a/c 341002, but the signal is not yet back", "@Zuku_WeCare @ZukuOfficial Are you back up running? A/C no. 180317", "@ZukuOfficial hey have sent the phone number", "@ZukuOfficial okay thanks", "@ZukuOfficial there it is https://t.co/t1UPlkNaTO", "@ZukuOfficial have sent the no", "@ZukuOfficial I have been requesting for a technical team since Saturday. Such a horrible display of customer service. \nUp your game please.", "@Zuku_WeCare @ZukuOfficial 61267 no signal. only one one channel working", "@ZukuOfficial would you please help to connect this account for this number 905479 for Mr R Mafunga he has paid but is not yet connected", "@ZukuOfficial @Zuku_WeCare My connection has been slow for the last one week close to no connection at all", "no signal found, ktn is the only functioning channel @Zuku_WeCare @ZukuOfficial", "RT @ShikoNguru: Yo, @ZukuOfficial , since I've been BLOCKED by @Zuku_WeCare, please tell me why there's no signal at my place 97097", "Will we ever get a good deal from our Kenya Digital Subscribers ( @ZukuOfficial 18century movie and @DStv_Kenya Expensive) #NKT !!", "Enjoy the Adams Family? https://t.co/qWuu9PvTE5 @NollywdREinvntd  @consattv @IfactoryLive  @ZukuOfficial 1800GMT today", "@ZukuOfficial Sorry.My bad. It was a problem of wrong password.", "RT @ZukuOfficial: @iCabway  Thanks for your feedback. We'll look into that.^DA", "@ZukuOfficial Not working on one phone! It is working on another.", "@ZukuOfficial When will the problem in our area resolved? Acc 98852. We are really inconvenienced.", "@Zuku_WeCare @ZukuOfficial check your dm.", "@ZukuOfficial Hi, My WIFI in my Office Zuku account has stopped working. It is failing at the authenticating stage. Please help. 086269", "@ZukuOfficial the last time I checked you had dispatched someone to my location.", "@ZukuOfficial @Zuku_WeCare any updates on internet service in kilimani?", "@ZukuOfficial no internet 142284😠😠😠😠", "RT @ShikoNguru: @ZukuOfficial  I had even made up with you guys LMAO! Y'all are back to ain't shit territory https://t.co/5pVskeuteK", "@ZukuOfficial Sawasawa. I will be waiting.", "@ZukuOfficial I thought we were past this.", "@ZukuOfficial ok waiting", "@ZukuOfficial What's wrong with the Internet not working since morning. Please check into the issue. A/c No: 51403", "@ZukuOfficial 3pm today kindly.", "@ZukuOfficial  @Zuku_WeCare what is happening with internet access on Dennis pritt kilimani area?", "@jjbaroudi at 1630GMT on #AMCSEREIS @ZukuOfficial Not so much #LoveAtFirstTaste in #HeartbreakHotel today https://t.co/yTEPmjBYCp", "@ZukuOfficial my account 196687 has never been installed! whatever happened to feedback? or 72hours lapse", "@ZukuOfficial Still waiting for any feedback...jeez", "@ZukuOfficial This is well noted. Thank you.", "RT @hopeliks: @DjSoxxy exactly and they don't even notify customers on subscription change. @Zuku_WeCare @ZukuOfficial have totally ignored…", "@ZukuOfficial Done", "@ZukuOfficial I am aware of the 'logistical issues'. What I'd like to know is how &amp; when it's being sorted.Nothing helpful from your end yet", "@ZukuOfficial It was 105390 in question", "@ZukuOfficial Your internet connection today is crap! Account number: 100032.", "@ZukuOfficial \n\"Knock Knock\"\n\"Who is there?\"\n\"No\"\n\"No..who\"\n\"No connectivity as usual dummy\"", "@DjSoxxy exactly and they don't even notify customers on subscription change. @Zuku_WeCare @ZukuOfficial have totally ignored my tweets!???", "cc @ZukuOfficial https://t.co/MmTaylv5Qy", "@ZukuOfficial See DM", "@Zuku_WeCare @ZukuOfficial this is not something I want to go through ever again.", "@Zuku_WeCare @ZukuOfficial which makes me pretty uncertain if I want to have you as my service provider again or even recommend you to a pal", "@ZukuOfficial @Zuku_WeCare care enough to fix the last. My connection was always limited as early as 6am- 12am and as from 4pm-6pm!!!", "@ZukuOfficial Hi, no internet on Ngong road. Is there an issue?", "@ZukuOfficial @ZukuOfficial ..connection has been a thorn in my life. Plaguing me with issues each time.  And you didn't care enough to.....", ".@zukuofficial Well noted", "@ZukuOfficial account number 145356 I have had horrible internet connection from yesterday please look into it", "@ZukuOfficial am getting unhappy with your movies #Movie #MovieMaz #MovieFamily . Kindly improve your movie to this century", "@ZukuOfficial do you have fibre at kahawa wendani?", "@ZukuOfficial @Zuku_WeCare my router's adapter has blown, courtesy of @KenyaPower_Care can I get a replacement?", "@ZukuOfficial when did my subscription change from 2999 to 3225? And why wasn't I informed? Account 124789", "@ZukuOfficial This has not been sorted out", "@ZukuOfficial So i cannot access zuku internet yet ?", "@ZukuOfficial thank you so much, your customer care have sorted it out.", "@ZukuOfficial thanks for the response... How about Internet services? That's what i really need.", "@ZukuOfficial hi, can i get zuku services in Kiambu town?", "@ZukuOfficial Hey do you have fibre in Ruiru ?", "@ZukuOfficial WE DON'T HAVE INTERNET CONNECTION AT MEDLINE HEALTH CARE \nACC NO.  002-104680", "@ZukuOfficial ooops, too bad. Could you have an estimate of when the fiber service will reach my place? I so need it meen", "@SirPhilip_B @ZukuOfficial BTW does the satellite have Internet too? What are the speeds?", "@aikawangwe Zuku is good.They always attend to customers problems within shortest time.Internet is reliable I must say.@ZukuOfficial", "@ZukuOfficial 363612", "@aikawangwe i got Zuku 30Mbps and its awesome @ZukuOfficial keep up the good work..", "@ZukuOfficial how long will i pay to receive this kind of services?am a disappointed with your services not worth it https://t.co/ZCdF7M30YS", "Good Morning! Quick Question. If you live in Kileleshwa, which fibre service would you recommend? @ZukuOfficial? or @FaibaJTL?", "@ZukuOfficial it seems to be working fine now. 👍", "@zukuofficial a/c128496 how much longer are we to wait over 12 hours of without service.kindly look into it.", "@ZukuOfficial no signal in ruaka. 2018890414", "@ZukuOfficial \nWhen are you getting to Makadara next to the Railway station on Jogoo road?", "@ZukuOfficial my account number is 516872.", "@ZukuOfficial what's the problem on 158463?", "@ndegwapower i had @ZukuOfficial a while back, service was 🙍 then went to @OrangeKe_Care who cancelled unlimited WiFi without telling us.😔", "@ZukuOfficial does it give you pleasure to charge exorbitant prices and in turn give shitty service? Is it ethical what you do?", "@Zuku_WeCare @ZukuOfficial Account 125942..", "@Zuku_WeCare @ZukuOfficial Last year we had  3 users in the house and the speed was okay,this year its only me and the speed is devastating", "@IbrahimKimutai @KenyattaUni KUTv on @ZukuOfficial is??", "@ZukuOfficial immediate response to account no 125273 needed it's not connecting to internet since 1400hrs", "@ZukuOfficial I've had no service since 8:50pm. The account no. is 180317", "@zukuofficial oooh ok thank you no I was just inquiring since I want to get", "RT @EbruTVKenya: #MondayBlues Watch us on @ZukuOfficial channel 17 @GOtvKenya 96 and @StarTimesKenya 102 #CafeNgoma #16thOfMay https://t.co…", "@ZukuOfficial noticed that my dish needs realignment", "RT @EbruTVKenya: #MondayBlues Watch us on @ZukuOfficial channel 17 @GOtvKenya 96 and @StarTimesKenya 102 #CafeNgoma #16thOfMay https://t.co…", "LMAO, nice reference @ZukuOfficial @RASHADz_", "@ZukuOfficial @Zuku_WeCare internet terribly slow, saitan.", "@Zuku_WeCare @ZukuOfficial  kindly restart my link. I am getting slow speeds. Account 159259", "@ZukuOfficial no service .. A/C no 180317", "Same sentiments...since last week @ZukuOfficial has been terrible https://t.co/xPYk6oUp3X", "@ZukuOfficial my decoder doesn't function at all whenever it rains, please help.", "@ZukuOfficial thanks. But as they say \"nimeshafunga virago\". I will give you feedback in the morning.", "It Keeps getting worse ,take us back to 10mbps @Zuku_WeCare  @ZukuOfficial  https://t.co/jXrD8rJon6", "@ZukuOfficial my zuku isnt showing just the zuku logo what to do", "RT @EbruTVKenya: #MondayBlues Watch us on @ZukuOfficial channel 17 @GOtvKenya 96 and @StarTimesKenya 102 #CafeNgoma #16thOfMay https://t.co…", "@verbstract @ZukuOfficial 🙌🙌🙌🙌", "Mko down @ZukuOfficial \n\nLiterally.", "@zukuofficial I mean the installation", "#MondayBlues Watch us on @ZukuOfficial channel 17 @GOtvKenya 96 and @StarTimesKenya 102 #CafeNgoma #16thOfMay https://t.co/cSBMhE0W7N", "@zukuofficial what should I do my box has no signal", "@ZukuOfficial ok", "@Zuku_WeCare so lights were on and off in my house and they blew up the adapter to my router, can i have it replaced? @ZukuOfficial", "@ZukuOfficial hi,my box still has no signal", "@ZukuOfficial hello how long does it take to connect everything for the wifi?", "@ZukuOfficial no service @86746 whole PM. Poor service whole of last week. Not even perfunctory texts purporting to be sorry. @Zuku_WeCare", "@zukuofficial reconnection please", "Worst advice! Hiked prices and no service! Apparently my connectivity IS ON DRUGS. HIGH-NO @ZukuOfficial  There is no solution! Exit plan 😠😠", "Am in an abusive relationship with @Zuku_WeCare @ZukuOfficial!! What did account 69513 ever do to you?????? Too much.... #internetondrugs", "@ZukuOfficial ok, thanks for the info, it is back, so it is more of a Kenya Power thing", "No TV signal no Internet @ZukuOfficial what's happening??", "@ZukuOfficial we're good now. Thanks.", "@ZukuOfficial not yet, I'm still getting a  Scrambled signal.", "@Ken_Murage @Zuku_WeCare @ZukuOfficial @Bobbysyoks thanks for the heads up plan b now", "@Ken_Murage @Zuku_WeCare @ZukuOfficial @Bobbysyoks does this mean no service today am screwed man", "Hi guys.. Do you know that your internet is worse than it was before you \"upgraded\" me? Why am i paying extra? @Zuku_WeCare @ZukuOfficial", "@Ken_Murage @Zuku_WeCare @ZukuOfficial @Bobbysyoks umo121 yes bro what is niko na tender", "@Zuku_WeCare @ZukuOfficial @Bobbysyoks @Ken_Murage tutaishi hivi sasa", "@ZukuOfficial good evening.my decoder no is 2S48008002151. Smartcard no is N 71305318652.Please kindly let me know my acct no. I forgt", "Starting Tomorrow on #AMCSERIES #1730GMT Starring @reptileland  @glangiri @ADELLEO #JoedNgaruiya  @ZukuOfficial https://t.co/5XsSXtn0av", "@ZukuOfficial 😊😊😊", "@ablewireless thank you so much.. the area around the garage is strong @ZukuOfficial msikuje ngumba", "@ZukuOfficial I ask again, when will I get the 15mbps ?", "@Trackmann @ZukuOfficial tuko pamoja 😢", "@ZukuOfficial I don't have Internet since 2pm...my account is 170978", "RT @Trackmann: @ZukuOfficial hey I'm getting only 8% of advertised speeds. What's up ? 76253 https://t.co/b02PUWO8zj", "@ZukuOfficial hey I'm getting only 8% of advertised speeds. What's up ? 76253 https://t.co/b02PUWO8zj", "@ZukuOfficial it keeps going off , I have rebooted twice . Hope it doesn't go off again", "@ZukuOfficial have decided I won't watch #GameofThrones today. 😏", "@ZukuOfficial thanks for the reply it auto disconnects, let me observe will let you know of any changes. cheerz.", "@ZukuOfficial @Zuku_WeCare account no 185359 is still not working", "@ZukuOfficial thanks for the quick response yesterday, but please fix citizen tv", "@Zuku_WeCare @ZukuOfficial having network issues in Komarocks A/C168076", "@ZukuOfficial no connectivity", "@ZukuOfficial How much does it cost for the zuku internet? Buru buru", "@ZukuOfficial how long is the 30% discount running for?", "Is the Internet broken or I'm hell? @zukuofficial @safaricom", "RT @ZukuOfficial: Celebrating all mothers for all that they have done to raise us. Happy mother's day to all mothers. https://t.co/ajLgp8rI…", "@ZukuOfficial, @Zuku_WeCare UR banner on Malindi Road after Bella plaza, a safety risk https://t.co/DVmINCqX1S https://t.co/u0aEctCNRK", "@ZukuOfficial thanks guys its sorted", "@ZukuOfficial I'd like to subscribe to the 27 smart channels bouquet. I've already made  payment. Please effect the change. Acc no. 497812", "Slow internet is the second most annoying thing in my house, the first being @ZukuOfficial off course😞", "@Zuku_WeCare @ZukuOfficial  this billing cycle alone that started on 27th April I have lost 5 days not fair.Waiting for my bill", "RT @AMCChannels: Coming soon !  Windeck - English  on #AMCSERIES this Thursday at 1800GMT @consattv  @ZukuOfficial @startimesrwanda https:/…", "@ZukuOfficial how many times will u people hav power problems.. unreal!", "@ZukuOfficial @Jairodiih how to increase span", "@ZukuOfficial no internet 142284!", "@ZukuOfficial the usual state.", "@ZukuOfficial if i get the TV pkg first will i need to get a new installation when upgrading to fiber pkg as well or will it jst be added.", "@ZukuOfficial working now", "@Zuku_WeCare @ZukuOfficial Day 2 and numerous calls later service not restored. Refund my money, sure Mbugua will sort me out ASAP", "@Zuku_WeCare @ZukuOfficial Account 166816 down. No TV and Internet.  Kindly advice", "Coming soon !  Windeck - English  on #AMCSERIES this Thursday at 1800GMT @consattv  @ZukuOfficial @startimesrwanda https://t.co/J7IaUcoAVq", "@Zuku_WeCare @ZukuOfficial Your twitter handle makes a mockery of your level of Customer Service. I paid for a service it was not free!!!", "Yeah @ZukuOfficial is killing me with boaring shows https://t.co/OgSEWiYcAq", "@ZukuOfficial internet keeps going on and off plus its really slow. Fix it a/c 139664", "@Zuku_WeCare :DM (2)\n@ZukuOfficial", "@ZukuOfficial ..Internet is not working zuku1329", "@ZukuOfficial nothing has happened though since i paid", "RT @AMCChannels: Watch  @themonjaro in TheCalabash on #AMCSERIES Friday 1630GMT @ZukuOfficial ch 229 @StarTimesKenya ch 072 https://t.co/Sm…", "@zukuofficial thank u.", "hi @Zuku_WeCare :DM @ZukuOfficial", "@ZukuOfficial my account number is 134562. The wifi works ok on my laptop but does not work on my phone.", "@zukuofficial pliz follow back for DM", "@ZukuOfficial nvm I found the passphrase thanks though", "@ZukuOfficial router*", "@ZukuOfficial hi...my touter has been reset to factory setting ... Can you guys dm me the default password ??", "@ZukuOfficial Zuku please not the HouseHelp package again😓. I have no net now yet during the day I was informed that it was there", "@zukuofficial acc 354221\nName. Emmanuel Ekirapa", "@ZukuOfficial I paid 400 bob and it's nt active yet", "Watch  @themonjaro in TheCalabash on #AMCSERIES Friday 1630GMT @ZukuOfficial ch 229 @StarTimesKenya ch 072 https://t.co/Sm6iF2SNdX", "@ZukuOfficial why is the internet slow in buruburu since Sunday at 3pm.", "@ZukuOfficial @Zuku_WeCare  introduce a postpay service so that client pay for only what is used. Advance payments is shortchanging clients.", "@ZukuOfficial @Zuku_WeCare still no connection for the past 2 days for AC 172815. Your service is becoming quite unreliable lately.", ". @Zuku_WeCare @ZukuOfficial no signal 61267", "@ZukuOfficial @nate430  @billyallela baba nathan", "@ZukuOfficial @nate430  which parts of tassia?", "@ZukuOfficial I am just curious. I hear very good things about zuku these days.", "follow back for DM @zukuofficial", "@zukuofficial manze!!!", "@ZukuOfficial sortilegio again #zukunovella. Mnarepeat vipindi sana", "@ZukuOfficial connection restored. Thank you", "@ZukuOfficial Where is the nearest to here I can have the Zuku Fiber? I would like the fiber service as I am an heavy internet user.", "Hello @ZukuOfficial Line has been out since Saturday night. No response/asstance delivered the weeknd. Account number 178250, Mirema Drive", "Eh... @ZukuOfficial what's up with the line up? Where's confessions of telenovelas?", "@ZukuOfficial Hello, a quick one here, Do you guys have fiber coverage along N.Airport Road? I reside near Coop Bank Embakasi. #ineedfiber", "@Zuku_WeCare @ZukuOfficial check dm n respond asap please", "@ZukuOfficial checkdm", "@ZukuOfficial no internet on ac 110574. This issue is never going away, is it?", "@ZukuOfficial Hey? I have 4mbps, is t posible i upgred 2 that package that comes with TV? Saw a friend in Buru paying the same 4MBPS with TV", "@Zuku_WeCare @ZukuOfficial no tv &amp; no internet a/c no. 89433.", "@ZukuOfficial??", "@AtotiNyarasembo did they respond? I am curious to see how this pans out. @ZukuOfficial", "@ZukuOfficial Internet down, Kindly fix", "Hi @ZukuOfficial I accidentally sent money to you in the form of Mpesa kindly assist in reversing the order.", "@ZukuOfficial 0725135721", "@ZukuOfficial @Jane_Kebenei Thanks the technician fixed another modem and I hope this resolves our Internet access issues...", "@ZukuOfficial \nWhat is wrong with your syokimau connection?it has been down since yesterday morning.The downtimes are now becoming too much!", "@ZukuOfficial @Zuku_WeCare hello!!! Are you there????", "@ZukuOfficial sent", "Hey @ZukuOfficial my net can't even load a single fuckin page bro. Help before I start cursing the day.", "@ZukuOfficial I hope you guys will come today. Thanks", "@ZukuOfficial account 120535 no internet", "@ZukuOfficial thanks...", "@ZukuOfficial when do we expect your technical team to fix our issue, acct 105793? Internet is crucial. Please", "@ZukuOfficial.... 128927 my account not working since yday 11pm can u please chk...", "Just escaped daylight robbery in nairobi @Zuku_WeCare @ZukuOfficial #hanguponmenow #resetyourgoddamnselves pleasures of life!", "When you lie, your people lie, you hang up and you don't care-all your customers say you are shit on open forums! @Zuku_WeCare @ZukuOfficial", "Goodbye to the worlds worse internet service @ZukuOfficial @Zuku_WeCare thanks for not caring and hope you rot in hell forever! #happiness", "@ZukuOfficial a/c 90005, Internet has been going on and off every 10 minutes for the last 4 days, its really bad for streaming please help.", "@Zuku_WeCare @ZukuOfficial what is wrong with my Wi-Fi  can't use laptop or phone Wi-Fi but LAN cable works. 191517", "@ZukuOfficial Internet not working for the past 5 hours! Please look into the problem. A/c No: 51403", "Hi @ZukuOfficial", "@Zuku_WeCare @ZukuOfficial how long before i get a response?", "@ZukuOfficial u mean celebrating zuku? Such bullshit", "@ZukuOfficial Haiya!! You guys refused to call me as promised!", "@ZukuOfficial @Zuku_WeCare @ConsumersKenya frustrated. I used an external server to run a BW test. Explain this? https://t.co/7B3BrBHcwf", "@ZukuOfficial gone again. Like wtf?", "@Zuku_WeCare @ZukuOfficial I have no service since yesterday for acc 128164.Call customer care twice but no service yet", "@ZukuOfficial no internet still..", "@ZukuOfficial sort this or credit me back!!191886", "@ZukuOfficial u system is very efficient when sending reminders on bills, no wkd goes without a \"line cut\" on my end 191886", "@ZukuOfficial Is there system breakdown around Umoja area for the internet?", "@ZukuOfficial hi, there is no signal in Syokimau. Help", "@ZukuOfficial wats the progress on this? No net yet!!! 191886!", "@Zuku_WeCare @ZukuOfficial hello no internet the whole day in embakasi skyline ac180047", "@ZukuOfficial I never got a call on this number. So reach me on the same number and advice what time you will FIX the 3 day problem", "@ZukuOfficial extremely poor connection. Getting worse - 105772 https://t.co/MSh2hzdggh", "@ZukuOfficial better, thanks alot", "@ZukuOfficial yes everything is now okay", "@ZukuOfficial Bad connection on acc 105772", "@ZukuOfficial My connection has been this pathetic whole weekend. Less than 25% of what i am subscribing for! https://t.co/fN6IH8GbFj", "@ZukuOfficial once again. No network for the last one hr. Zuku still want to keep us as clients? SMFH!! @ConsumersKenya", "@ZukuOfficial 84462 my wifi is down again.  Technician was here, but wifi is down again!", "@ZukuOfficial @Zuku_WeCare so you only give rebate if the downtime is more than 48 hours? @ConsumersKenya", "@ZukuOfficial why you ignoring me? Fix my internet!!!", "@ZukuOfficial @Zuku_WeCare I am experience really slow speeds. I have talked to 3 different customer care agents and it's still not fixed 😔", "@ZukuOfficial fix my internet speeds acc 85714", "@Zuku_WeCare @ZukuOfficial now its timeout my account is 152887 please now i request a technician to be sent kesho https://t.co/kjSj3Ojy8I", "@ZukuOfficial 15Mbps speed test results.... https://t.co/xEsLigaJEs", "@ZukuOfficial Check out my speed test results. I'm on the 15Mbps package", "@Zuku_WeCare @ZukuOfficial please fix my internet. 100059.", "@ZukuOfficial kindly check account number 186758.  Been down since morning", "@ZukuOfficial not again with your incompetence in imara daima", "@ZukuOfficial downtime still persists in Tena?", "@ZukuOfficial @Zuku_WeCare half my day lost and you're still working on it... on time lost you ought to be fired. Poor service...", "Bado @ZukuOfficial ????? https://t.co/N4C2iEwzzg", "@Zuku_WeCare @ZukuOfficial  the service is down again am even lucky the test page has loaded after an hour of trial https://t.co/c5JULYHIFn", "@ZukuOfficial hi. We haven't not had signal since early afternoon today. Urgently resolve", "@ZukuOfficial thank you. Its fine now!", "@ZukuOfficial come on meeeen!!!!!!! We NEED THE INTERNET!!!!!! PLEEAAASSSEE!!!!!", "@ZukuOfficial @Zuku_WeCare unstable connectivity... can't even get 5mbps", "@ZukuOfficial yo! we had no connection since morning what's going on. You said the day won't end w/o fixing. Check the account 0720738252 😠", "@ZukuOfficial All is ok now . Thanks", "@ZukuOfficial Yo Zuku. It's been 3 weeks since our last interruption. What are you doing about it", "@Zuku_WeCare @ZukuOfficial  what's wrong with the internet in syokimau area?! It's been almost a whole day", "@ZukuOfficial the link is not opening and your Mpesa platform is not working.", "@ZukuOfficial day long low speed on my connection a/c 193787", "@ZukuOfficial what's up with paying the same as neighbours but not getting the same channels? #howsway? #how #zukutv", "@ZukuOfficial 105793", "@ZukuOfficial 096973.", "@ZukuOfficial modem not connecting, 155733", "@Zuku_WeCare  @ZukuOfficial  no service in Imara Daima.", "@ZukuOfficial what's up with acc no. 432212....since yesterday Error E52", "@ZukuOfficial I need to be assisted to make payment for my account", "@ZukuOfficial @Zuku_WeCare still no word rebate for the downtime we experienced? @ConsumersKenya", "@ZukuOfficial it's both Internet and tv can't access either. Truly inconvenienced us. Acct # 105793", "@ZukuOfficial  @Zuku_WeCare Internet connection too poor in Kasarani. Please resolve asap!", "@ZukuOfficial your people promised to be here btwn 2-6pm. It reaches 6pm and now they can't show up. It's an issue that needed site visit.", "@ZukuOfficial @Zuku_WeCare dont I have not had services in Imara Daima all day now! Account 113307", "@ZukuOfficial Unstable network.", "@ZukuOfficial I've already sent", "@ZukuOfficial Internet has been very slow and unstable for the last couple months. What's going on? #fromNairobi", "@ZukuOfficial no service for a week now ... #126674", "@ZukuOfficial As always", "@ZukuOfficial so today no tv, I should now go back to dstv", "RT @kamaveli: #kenyacupfinal #KenyaCup live on @ZukuSports @ZukuOfficial #Rugby #Kenya   https://t.co/416OksXZ2b", "RT @kamaveli: Game live! @ImpalaSaracens vs @KabrasSugarRFC #KenyaCup #kenyacupfinal #Kenya #Rugby on @ZukuOfficial @ZukuSports  https://t.…", "@ZukuOfficial you truly the worst at customer service. 3 bloody days and excused from your customer service. Outraged 😡😡😡😡", "@ZukuOfficial when is normal service resuming in Tena?", "@ZukuOfficial I have dm", "@ZukuOfficial connection problems. \nAcc 195107. Any thing we need to know?", "@ZukuOfficial @Zuku_WeCare Account 90065 is down. Kindly support urgently", "@ZukuOfficial how do I remove a message on screen without a remote control device. I need to press ok..", "@ZukuOfficial will it be fixed today?", "@ZukuOfficial @Zuku_WeCare why the slow speed this is not what I pay for. What is the excuse today?\nSort it out 136687.", "@ZukuOfficial @Zuku_WeCare We're out again. Sigh. https://t.co/Dz8Lo4MvJq", "@ZukuOfficial is there any problem with Internet at ngara area", "@ZukuOfficial follow back for DM", "@ZukuOfficial no internet almost the whole day..whats wrong?", "And they always lie its a problem affecting your area... Now uko Nairobi and I'm in Machakos, so now? @ZukuOfficial https://t.co/rIRPNwTrZG", "@ZukuOfficial account number 128574", "I said I won't insult them today because....its Sunday😃. Kesho, all the sewage will be spilt on @ZukuOfficial TL!! https://t.co/dl0FaDnlAc", "@ZukuOfficial internet is down on account number 107222", "@ZukuOfficial asante,  nitaangalia iyo maneno", "@ZukuOfficial connection down AC, 131866", "@ZukuOfficial so you guys don't reply to DM on Sundays or what?", ".@ivy_tes @ZukuOfficial This relationship is so hard...renewed subscription Jana after giving Zuku silent treatment... Today no net. Smh", "@kenotyc @Zuku_WeCare @ZukuOfficial yup and it's down again! Refreshed gadgets as advised and it never stays up for long!", "@ZukuOfficial hi.. Haven't had net since midnight yet the subscription is meant to expire on the 25th of this month.. What's up?", "@zukuofficial account 177711, no internet access.", "@zukuofficial am paying for 30mbps 113181 not the 3 mbps I have now..", "Kindly check this modem @Zuku_WeCare @ZukuOfficial https://t.co/SKz92JbJJy", "@ZukuOfficial Your services are down for the last two hours. Acc is 192414. Please check and inform me.", "@ZukuOfficial Please check if Ï have paid or not 570601", "@ZukuOfficial Zuku ain't working!!", "@ZukuOfficial we have no internet since morning. Urgently Sort! 191886", "@ZukuOfficial yes it is", "Hi @ZukuOfficial, kindly check for me a/c no. 195441. My internet has been down for a better part of today. I had also sent you an e-mail", "@Zuku_WeCare @ZukuOfficial hi 180651 doesn't have internet kindly assist.", "@ZukuOfficial hey my due date is on the 11th so why is it off????", "@ZukuOfficial kindly assist me..paid my zuku yesterday morning and it's not working", "@ZukuOfficial @Zuku_WeCare Account 113769 down since 12pm... What is happening?!?!", "@ZukuOfficial hi, I have paid my bill for two months in advance. Please confirm it reflects the same on your end. Ac. 181344", "@ZukuOfficial no error its just blank black screen when a play radio stations", "RT @ZukuOfficial: Celebrating all mothers for all that they have done to raise us. Happy mother's day to all mothers. https://t.co/ajLgp8rI…", "@ZukuOfficial done all that still no radio stations working", "@ZukuOfficial Does the Diamond plaza shop also close at the same time?", "@ZukuOfficial r u guys going 2 air Euro", "@ZukuOfficial hey radio stations not functioning 61267", "@ZukuOfficial So what am I to consider when signing up...Mbps or LATENCY? you never said the 1Mbps flactuates..liars..", "Hello @ZukuOfficial what time does your shop at Junction close today?", "@ZukuOfficial Your internet in Ruaka is chaotic can someone tell me why i have to wait 3 minutes before a page loads? SORT IT OUT!!!!!", "@ZukuOfficial you are experiencing downplay in Imara Daima.. fix it", "@ZukuOfficial my WIFI has disconnected, ACC 191679", "@ZukuOfficial my wifi has diconnected please help out ACC 191679", "@ZukuOfficial So one device on social media sites can exceed the allowed bundle? Coincidentally over weekends? You guy could not explain", "@Azra_Thobani @Zuku_WeCare @ZukuOfficial so sad", "@ZukuOfficial no internet access 187982", "@ZukuOfficial 3300 one I already paid", "@ZukuOfficial you have cleverly added the cost of handset. This is playing tricks on your customers, not a caring gesture.", "@ZukuOfficial I have experienced internet interruption since yesterday, my account number 113981, kindly attend to the complaint.", "@ZukuOfficial - internet very unstable today. Works for a while and doesn't work for a while. What's the issue??", "@Zuku_WeCare @ZukuOfficial  wakubwa internet kucheza brikicho maze acc 193761", "@ZukuOfficial Isn't that expected when you put people on a shared network? You expect me to control such usage or what?", "RT @ZukuOfficial: Celebrating all mothers for all that they have done to raise us. Happy mother's day to all mothers. https://t.co/ajLgp8rI…", "@ZukuOfficial Hi I can't access my internet on acc 108059", "@ZukuOfficial not yet same only kass fm", "@ZukuOfficial account 156198 off..What's up", "@ZukuOfficial hey no network since morning", "@ZukuOfficial How much is a zuku satellite dish plus installation? I have the decoder", "RT @ZukuOfficial: Aren't mums just INFINITEly amazing? #happymothersday https://t.co/seOZP2cIf9 https://t.co/5KCDK6XXIU", "@ZukuOfficial  my concern is still outstanding.", "@ZukuOfficial having issues connecting to the internet. Ac number is 096966. Kindly let me know what the issue is. Thanks", "We need to have a chat @ZukuOfficial @Zuku_WeCare", "RT @ZukuOfficial: Celebrating all mothers for all that they have done to raise us. Happy mother's day to all mothers. https://t.co/ajLgp8rI…", "@Zuku_WeCare @ZukuOfficial no radio stations,only kass fm available. 61267", "RT @ZukuOfficial: Celebrating all mothers for all that they have done to raise us. Happy mother's day to all mothers. https://t.co/ajLgp8rI…", "The test speed screenshot  is refusing to upload 😳😳😳 @Zuku_WeCare @ZukuOfficial", "RT @ZukuOfficial: Aren't mums just INFINITEly amazing? #happymothersday https://t.co/seOZP2cIf9 https://t.co/5KCDK6XXIU", "RT @ZukuOfficial: Celebrating all mothers for all that they have done to raise us. Happy mother's day to all mothers. https://t.co/ajLgp8rI…", "RT @ZukuOfficial: @Smith_Hempstone Hi,full setup kit plus 1 month free view goes for 5999/-.^DA", "RT @Smith_Hempstone: @iCabway @ZukuOfficial @GOtvKenya @BambaTVKenya How much is zuku? Startup cost.  First time", "@iCabway @ZukuOfficial @GOtvKenya @BambaTVKenya How much is zuku? Startup cost.  First time", "I know right or @ZukuOfficial for 399/- a month https://t.co/1mXTibIA9f", "@ZukuOfficial What is going on with internet in kileleshwa? Since yesterday. Account 165803", "RT @ZukuOfficial: Aren't mums just INFINITEly amazing? #happymothersday https://t.co/seOZP2cIf9 https://t.co/5KCDK6XXIU", "RT @ZukuOfficial: @Kamakil  Hello Kamakil, the internet modem appears offline . Reboot the device from power source to refresh.^DA", "RT @Kamakil: @Zuku_WeCare @ZukuOfficial My net is out again 4 the umpteenth time.I expect credits into my account 4 all outages over the pa…", "RT @ZukuOfficial: @Kamakil Hello Kamakil, the internet modem appears offline . Reboot the device from power source to refresh.^DA", "RT @Kamakil: @Zuku_WeCare @ZukuOfficial Thus I do not expect to be disconnected on the 10th. You have reports. 178353.", "@ZukuOfficial Please reconnect my account.  155740", "@Kamakil @Zuku_WeCare @ZukuOfficial mine too. There is no difference with the 4G. It doesn't deserve the extra charge", "@Zuku_WeCare @ZukuOfficial Thus I do not expect to be disconnected on the 10th. You have reports. 178353.", "@Zuku_WeCare @ZukuOfficial My net is out again 4 the umpteenth time.I expect credits into my account 4 all outages over the past 2 mnths", "@ZukuOfficial is better", "@ZukuOfficial no network connection in Eagle Plains area. Zuku... \nWe are literally behind your office.", "@ZukuOfficial back to no wifi!!! 😡😡😡😡", "@ZukuOfficial you mean now it is! After I complained! Do I need to keep complaining every-time it goes down ?", "@ZukuOfficial @Jane_Kebenei thank you", "@ZukuOfficial net goes off every single sunday guys what is this mess!!!", "RT @ZukuOfficial: Celebrating all mothers for all that they have done to raise us. Happy mother's day to all mothers. https://t.co/ajLgp8rI…", "@ZukuOfficial Hi. I finally got through to Customer Service on phone. Thanks", "Internet down! Again! @Zuku_WeCare @ZukuOfficial how many days in a month are you actually giving us the 15mbps we are paying for ?", "RT @ZukuOfficial: Celebrating all mothers for all that they have done to raise us. Happy mother's day to all mothers. https://t.co/ajLgp8rI…", "RT @ZukuOfficial: Celebrating all mothers for all that they have done to raise us. Happy mother's day to all mothers. https://t.co/ajLgp8rI…", "@ZukuOfficial There has been no network since yesterday.My a/c is 139396", "@zukuofficial ??", "@ZukuOfficial I cannot see my wifi on my devices. It has reset itself to another name. Kindly assist.", "@ZukuOfficial I haven't been having internet nor am i able to watch tv since yesterday evening. ??", "@ZukuOfficial my internet speed is annoyingly slow. A/c 163457....reset yesterday but the issue is back. Resolve ASAP n revert @Zuku_WeCare", "@ZukuOfficial my internet speed is annoyingly slow. A/c 163457....reset yesterday but the issue is back. Resolve ASAP n revert", "@ZukuOfficial with internet because i see it has ethernet port.[2]", "@ZukuOfficial i bought uku decoder that supports internet, can i be able to use it with dish without connecting it [1]", "@ambulacecil1 @RobertAlai @ZukuOfficial Bandit economy my brother...we are literally trapped.", "This is @ZukuOfficial, you pay for 1MBPS and get 0.30MBPS..outright robbery @RobertAlai https://t.co/zUrV0F6zyr", "@ZukuOfficial you have to follow back for me to DM.", "@ZukuOfficial you have a seemingly very interesting documentary on Nature but it's all in German, no subtitles, who is your audience?", "@ZukuOfficial I need link resetting, my internet is going slow, and streaming is becoming a problem, 193532 is my account,", "@ZukuOfficial why are your speeds slow???", "@ZukuOfficial ai..too much downtime..", "@ZukuOfficial Help me understand why service is bad whenever its rains. Does the rain affect the fiber cables? I know a guy @Jane_Kebenei", "@ZukuOfficial will you sort me out?", "@ZukuOfficial please reset my link 57801. It's been going slower and slower. Streaming a problem.", "@ZukuOfficial e76message. Please assist", "What's happening with the connection speeds in SB. @ZukuOfficial. They are annoyingly slow!!", "@asaanavikta @ZukuOfficial Awesome!Will keep fingers crossed that it happens :)", "Dear @ZukuOfficial n @Zuku_WeCare just paid Sh400 for Smart Pack via Mpesa here KE76P3TUP4. Was in another package. Don't switch off. 461746", "@ZukuOfficial -0725066283", "@Zuku_WeCare @ZukuOfficial .....connections down.....?", "@zukuofficial follow back for a dm", "@ZukuOfficial Why are you guys robbing us by not giving what we have paid for", "@ZukuOfficial Why has my connection been intermittent for past month with it being 👇 60% of the time 98697", "@ZukuOfficial it's now fine.", "@ZukuOfficial Why dont you first improve service for those already connected? For a wk I been getting 1mbps yet I pay for 15mbps!", "Kindly suspend account 553839 as am out of the country. Kindly add a note to the effect. Thank you @Zuku_WeCare @ZukuOfficial", ". @ZukuOfficial I cannot report any change please...same old annoying slow speeds.", "@ZukuOfficial We Have Paid But Still No Connection.Reference Number Is 432494.", "@ZukuOfficial no assistance at Hardy Karen what's up no connection day two", "@Zuku_WeCare @ZukuOfficial check dm", "@ZukuOfficial @Zuku_WeCare Hi. Urgently check and advise. No Internet 178353", ". @ZukuOfficial Is there any progress. Nothing has change on this side.", "@ZukuOfficial Hi, how do i begin my relationship with you?? any quotations for first time installments? requirements? thank you..", "@ZukuOfficial NO it isnt", "@Zuku_WeCare @ZukuOfficial You promised 15 MBPS you delivered 2.86 MBPS. This is a rip off. Ac.192564 https://t.co/fzAmnsVctH", "@ZukuOfficial it is NOT on", "@ZukuOfficial 180454. Please do. the downtime is becoming common over weekends.", "@wamaephilip @odungareh @ZukuOfficial hiyo ni #safetweet", "RT @wamaephilip: Saa hii ndio livefeed inarudi #KenyaCup #kenyacupfinal @ZukuOfficial enyewe mvua imewamek it", "Saa hii ndio livefeed inarudi #KenyaCup #kenyacupfinal @ZukuOfficial enyewe mvua imewamek it", "@innomo @odungareh @ZukuOfficial sitakuwa part of siasa tena 😂😂😂😂😂 #KenyaCup #kenyacupfinal", "@wamaephilip @odungareh hii @ZukuOfficial  ni fake sana mvua signal gone watolewe Kenya rugby kama jalango", "@ZukuOfficial 84462  thank you for calling.  Please try to reset so I can finish my work tonight", ". @ZukuOfficial why is you internet so weak over weekends, cant something be done? Frustrated in Umoja.", "@ZukuOfficial check DM", "@ZukuOfficial of course. Intermittent means it's on and off but do you guarantee up time for the rest of the weekend?", "@ZukuOfficial 84462 wifi has gone off again.  I have so far sent you 16 messages this month alone!", "@Zuku_WeCare,@ZukuOfficial,is ur TV decoder programmed to lose signal when it rains?", "@OrangeKe_Care sometimes I get frustrated by your Internet but then I visit @ZukuOfficial 's FB page and Orange starts looking very good.", "@kamaveli @Inside22RugbyKE @ImpalaSaracens @KabrasSugarRFC @ZukuOfficial @ZukuSports They kept scrolling that they will switch to the game", "RT @matrixster: I've been a @ZukuOfficial apologist. But since you increased your prices, your service has been utter crap. Get your stuff…", "@ZukuOfficial Connectivity has disappeared again.", "@ZukuOfficial Check DM", "RT @kamaveli: They are on a current affair story @gerald_chege @Inside22RugbyKE @ImpalaSaracens @KabrasSugarRFC @ZukuOfficial @ZukuSports", "They are on a current affair story @gerald_chege @Inside22RugbyKE @ImpalaSaracens @KabrasSugarRFC @ZukuOfficial @ZukuSports", "@ZukuOfficial Connection now improved", "@kamaveli @Inside22RugbyKE @ImpalaSaracens @KabrasSugarRFC @ZukuOfficial @ZukuSports K24 aje? We are really floating out here...", "@ZukuOfficial intermittent service at home &amp; work. Went to a client's on Ngong Rd jana and same exact issue. What's going on with you guys?", "RT @kamaveli: #kenyacupfinal #KenyaCup live on @ZukuSports @ZukuOfficial #Rugby #Kenya   https://t.co/416OksXZ2b", "RT @kamaveli: Game live! @ImpalaSaracens vs @KabrasSugarRFC #KenyaCup #kenyacupfinal #Kenya #Rugby on @ZukuOfficial @ZukuSports  https://t.…", "Game live! @ImpalaSaracens vs @KabrasSugarRFC #KenyaCup #kenyacupfinal #Kenya #Rugby on @ZukuOfficial @ZukuSports  https://t.co/16gQIbW7pX", "RT @kamaveli: #kenyacupfinal #KenyaCup live on @ZukuSports @ZukuOfficial #Rugby #Kenya   https://t.co/416OksXZ2b", "#kenyacupfinal #KenyaCup live on @ZukuSports @ZukuOfficial #Rugby #Kenya   https://t.co/416OksXZ2b", "@ZukuOfficial @Zuku_WeCare \nExtremely slow connection today. #62942", "I've been a @ZukuOfficial apologist. But since you increased your prices, your service has been utter crap. Get your stuff together please.", "@ZukuOfficial its 0728153329.....", "#My5FavoriteTweepsAre @Davidatipster @ZukuOfficial", "@ZukuOfficial for crying out loud, how can 24 hours pass by and no action from you? I know you said 48 hours, but that's  too long!!!", "@ZukuOfficial We have waited for ur internet services in Zimmerman for almost 2years. Thanks to @ablewireless wanakuja   sanaa", "The DeusseMag is out! https://t.co/LXojQi5nT9 Stories via @GEF_Europe @EaccNet @ZukuOfficial", "@ZukuOfficial That was on a light note.  Yaani, humor intended...", "@ZukuOfficial but for the decoder it's fine right??", "Dear @ZukuOfficial I'm so sorry I cheated on you with @DStv_Kenya. They don't know me like you do. I want you back. I'm sorry. Forgive me.", "@ZukuOfficial lower kabete shopping center", "@ZukuOfficial hey live in lower kabete and i am thinking of putting up zuku. Are your signals okay there and can i get internet?", "@ZukuOfficial hey no connection at Hardy Karen Acc. 112065", "RT @ZukuOfficial: Watch LIVE, KENYA CUP FINAL today from 4pm on Zuku Sports. \n\nGAME ON!!\n\nWatch it online: https://t.co/vdH7Ge1ySQ https://…", "@ZukuOfficial  then again it's still on and off. Account 169375", "@ZukuOfficial Patient? My clients don't understand that word. You also don't understand it when I fell to pay for your services on time!", "@ZukuOfficial If I had known,trust me ,I wouldn't have paid. I was told reconnection would be done today", "@ZukuOfficial Wait for 2 to 5 days? When I called ,I wasn't told about waiting. They told me to pay 2k and the technicians would be availed", "@ZukuOfficial account is not yet received  please assist 0722945985", "@ZukuOfficial its back up", "@ZukuOfficial 148533", "@ZukuOfficial internet not stable. Been going for 40 min or more 108983", "@ZukuOfficial @Zuku_WeCare no WiFi and no tv signal off wanyee road", "@ZukuOfficial not it's been three hours now since I paid", "@ZukuOfficial I cannot work because i can't access internet.This is the fourth day. Stop telling me to wait for 2 to 5days.", "@ZukuOfficial zuku I paid my net an hour ago and it's not yet active. Ac number 189405", "@ZukuOfficial  Is pissing off clients one of your services?Even after paying SHIFTING charges you still have ignored my reconnection request", "RT @ZukuOfficial: @asaanavikta  Hi Victor, we'll look into your request.^DA", "RT @ZukuOfficial: @asaanavikta  Hi Victor, we'll look into your request.^DA", "RT @asaanavikta: @ZukuOfficial is there a chance you will start airing uganda rugby games as well in the future (next season)?", "@ZukuOfficial thanks for the reply @Helkoybut how about that!!!", "@ZukuOfficial Houston, we have a problem with the signal", "@Zuku_WeCare @ZukuOfficial any update... service currently disconnected and I need to make payment 18943 check billing mail", "RT @ZukuOfficial: Watch LIVE, KENYA CUP FINAL today from 4pm on Zuku Sports. \n\nGAME ON!!\n\nWatch it online: https://t.co/vdH7Ge1ySQ https://…", "@ZukuOfficial how about 3/4 playoffs?", "RT @ZukuOfficial: Watch LIVE, KENYA CUP FINAL today from 4pm on Zuku Sports. \n\nGAME ON!!\n\nWatch it online: https://t.co/vdH7Ge1ySQ https://…", "@ZukuOfficial how long will the 30% discount run for?", "@ZukuOfficial is there a chance you will start airing uganda rugby games as well in the future (next season)?", "@Zuku_WeCare @ZukuOfficial I don't pay for this horrible speed. Sort it out 136687 https://t.co/SaqRLKdskQ", "RT @ZukuOfficial: Watch LIVE, KENYA CUP FINAL today from 4pm on Zuku Sports. \n\nGAME ON!!\n\nWatch it online: https://t.co/vdH7Ge1ySQ https://…", "@ZukuOfficial pls check DM", "@ZukuOfficial Hallo Zuku. Please check 100596. Erratic signal this week.", "@ZukuOfficial A/c 196024 still pending, am being asked to pay extra charges?", "RT @ZukuOfficial: Watch LIVE, KENYA CUP FINAL today from 4pm on Zuku Sports. \n\nGAME ON!!\n\nWatch it online: https://t.co/vdH7Ge1ySQ https://…", "RT @ZukuOfficial: Watch LIVE, KENYA CUP FINAL today from 4pm on Zuku Sports. \n\nGAME ON!!\n\nWatch it online: https://t.co/vdH7Ge1ySQ https://…", "RT @ZukuOfficial: Watch LIVE, KENYA CUP FINAL today from 4pm on Zuku Sports. \n\nGAME ON!!\n\nWatch it online: https://t.co/vdH7Ge1ySQ https://…", "RT @ZukuOfficial: Watch LIVE, KENYA CUP FINAL today from 4pm on Zuku Sports. \n\nGAME ON!!\n\nWatch it online: https://t.co/vdH7Ge1ySQ https://…", "RT @ZukuOfficial: Make your way to Greenspan Mall this weekend to get connected to Zuku Fiber &amp; win prizes! https://t.co/EugwHSSXwr https:/…", "@Zuku_WeCare @ZukuOfficial please assist. I am to do the payment now. A/c 379176", "@ZukuOfficial Sorry, this was meant for a different service provider. My zuku is okay.", "@ZukuOfficial fix my internet connection acc 85714", "@ZukuOfficial worst customer service I hav received.no internet connection since Monday yet Zuku is the least bit bothered. Acc no 95934", "@ZukuOfficial", "@ZukuOfficial  What do I do to change my wifi password?", "@ZukuOfficial @Zuku_WeCare experiencing unstable internet account 84799. Kindly check", "@ZukuOfficial acc no 540144", "@ZukuOfficial why is my account 557613 disconnected yet i hav paid", "@ZukuOfficial progress? I still cant see the network name", "@ZukuOfficial so can i start biashara ya wifi", "@ZukuOfficial I've responded to the DM", "@ZukuOfficial I've responded to your DM. Please action", "@ZukuOfficial  hey am having vry low or sometimes no internet connection A/C 137112 kindly assist.", "Hello @ZukuOfficial cam someone refer to the DM and assist?", "Requested a move yesterday @ZukuOfficial So far,no one has called me to confirm. Please help. Good morning", "RT @kngaine: @Zuku_WeCare @ZukuOfficial The Zuku joke is stale. My last payment may i atleast get uninterrupted svc 4 just a day.Ntashukuru…", "RT @LarryMadowo: Time to break up with @ZukuOfficial. 100% slower since the 'upgrade' and only available 10% of the time. Might as well lig…", "@ZukuOfficial the reception seem Ok now. Been frustrated all day about this. Please be issuing notices if anything...", "@ZukuOfficial Hi, I called in and was assisted nicely, so how am I to run the test if I don't have (cont) https://t.co/96Yn5J5Z0K", "@ZukuOfficial Itz not perfect, but bearable. Thank you very much for your assistance, have a lovely night.", "@ZukuOfficial 132216 router requires frequent reboots to work advice https://t.co/1tENDpvMTb", "@ZukuOfficial the speeds are still at a maximum high of 150kb/s", "RT @rhumbakitoko: We are on @StarTimesKenya channel 109, @ZukuOfficial 17 and @GOtvKenya 96 or stream live..https://t.co/lMjdEXel3d https:/…", "@ZukuOfficial Hi, a/c 12126, we're having very low speeds, latency 435ms, download 0.29mbps, 0.77mbps. Kindly assist", "RT @EbruTVKenya: We are on @StarTimesKenya channel 109, @ZukuOfficial 17 and @GOtvKenya 96 or stream live..https://t.co/rb2TAAvFOx https://…", "We are on @StarTimesKenya channel 109, @ZukuOfficial 17 and @GOtvKenya 96 or stream live..https://t.co/lMjdEXel3d https://t.co/mbGs9PmHvT", "We are on @StarTimesKenya channel 109, @ZukuOfficial 17 and @GOtvKenya 96 or stream live..https://t.co/rb2TAAvFOx https://t.co/Im4C8f7HYM", "@ZukuOfficial better thanks...", "@ZukuOfficial 167702", "Hi there @ZukuOfficial @Zuku_WeCare we are wondering if you have a solution to slow speeds and dropping of signal in and around Kilimani?", "@Zuku_WeCare \n@ZukuOfficial \nThe internet speed has been very slow today. What could be wrong?\nAcc no 187809", "@ZukuOfficial @Zuku_WeCare Slowly giving up on you...", "@ZukuOfficial your network services are just piss poor of late, itz  bad enough that i dont get the 1mb/s yall advertise which i paid for..", "@ZukuOfficial What is usually wrong with your signals once it rains?", "@ZukuOfficial i paid 30mins ago still no signal. Kindly help urgently. Cant reach you on mobile my no. 0714237282.", "@thesheef @zuku_wecare @zukuofficial zuku plz refund my money or else ul have it rough.u cant prosper by robbing us,i dnt want anythng else.", "RT @kioChaJamii: @zukuofficial @thesheef zuku is becoming a scam..service poor,cstmer care poor,u neva keep promises..what the hell is goin…", "RT @ZukuOfficial: Make your way to Greenspan Mall this weekend to get connected to Zuku Fiber &amp; win prizes! https://t.co/EugwHSSXwr https:/…", "@ZukuOfficial SMH! Isorait.", "@zukuofficial @thesheef zuku is becoming a scam..service poor,cstmer care poor,u neva keep promises..what the hell is going on???", "RT @ZukuOfficial: Make your way to Greenspan Mall this weekend to get connected to Zuku Fiber &amp; win prizes! https://t.co/EugwHSSXwr https:/…", "4every 1hr, only 15minutes of @ZukuOfficial connectivity. This is a rip off. Please compensate for this loss. @ConsumersKenya @kenyanpundit", "kindly check DM from me and act. expedite. @ZukuOfficial", "@ZukuOfficial see below https://t.co/Pi72iMc1wG", "@ZukuOfficial @Zuku_WeCare https://t.co/m8SlmaSm0c", "@ZukuOfficial is zuku fibre available in kasarani sunton", "@ZukuOfficial @Zuku_WeCare Day 2 with no Wi-Fi. Yet you did not even communicate. What's the time frame for fixing the issue?", "@ZukuOfficial @SaddiqueShaban My zuku-540176 is not working", "@ZukuOfficial hello,, I want zuku internet. Kindly let me know the packages that you have", "@ZukuOfficial @Zuku_WeCare buruburu phase 2, kikambuoni court", "Hallo @ZukuOfficial @Zuku_WeCare  24hrs+ still no service, ur guys came, cut off the cable and went away, no repairs https://t.co/It9FlxOPrr", "@ZukuOfficial @Zuku_WeCare this document I'm tryna send needs to get to you by 2moro so Assist me with Valid Email https://t.co/R9BOvIoajD", "Hi @ZukuOfficial zcheck dm", "@ZukuOfficial https://t.co/f4fKV6Ub6k \nThanks", "@ZukuOfficial Check my account 154565. 48 hours passed and no technician at site. Poor service", "@ZukuOfficial zuku very bogus service. After 48hrs no technician has come as promised. Will u refund me for NO 2 days internet? Bullshit", "There is a DM, @ZukuOfficial \n.", "@ZukuOfficial ok", "@ZukuOfficial ..please refresh my link.\nZuku 1329", "@ZukuOfficial it is. Thank you", "@ZukuOfficial alright.", "RT @ZukuOfficial: We are at the UON roundabout this morning! Stop by and interact with our lovely team. https://t.co/4Y8iROScp4", "@ZukuOfficial @Zuku_WeCare kindly urgently fix connection anomaly on account #59241 Thanks!", "@ZukuOfficial PON no light and LOS red light.", "I get it @SafaricomLtd my bundles are almost over.Waiting on @KenyaPower_Care to return power so i can force my self to enjoy @ZukuOfficial", "@ZukuOfficial waiting for your Reply on DM", "@ZukuOfficial ok, topped up already. Kindly send me prices for all packages, list of channels", "@ZukuOfficial 10633 R-zero  Again... I guess we need to discuss refunds or discounts on next billing cycle... fix it?", "@ZukuOfficial @Zuku_WeCare Hi i had an emrgncy issue 2 attend 2 &amp; trvlld out of nairobi.. I will let you know once I get bck ac no. 104543", "@kiariikimani internet I believe its where you live. For example My @ZukuOfficial  is fantastic but so many folks have horrid connections", "@ZukuOfficial ,it's fine only that I was misled by ur customer service guyz", "@ZukuOfficial acc no.112065. We are disconnected from the net.", "@ZukuOfficial Thanks alot for resolving this, i will do that.", "@ZukuOfficial A/C 320320 internet hasn't been working since yesterday 😒😑", "@ZukuOfficial that's fair thanks", "@ZukuOfficial Is there fibre coverage in/around Ngong?", "@ZukuOfficial id appreciate if you address my sentiments rather than just reply to tweets for the sake", "@Zuku_WeCare @ZukuOfficial 24hours n still counting. https://t.co/mEUbzHleZl", "@ZukuOfficial please get ur cable into bluebells gardens syokimau..twangoja sana", "@ZukuOfficial why is no one from Zuku responding to my message on DM", "RT @ZukuOfficial: @charlesKavithi Cheers, thanks for keeping it Zuku. *MA", "@ZukuOfficial 188359", "@Zuku_WeCare @ZukuOfficial The Zuku joke is stale. My last payment may i atleast get uninterrupted svc 4 just a day.Ntashukuru @ElijahMiano", "@ZukuOfficial the advert on media is different from what we are receiving from zuku.i ve not even paid once,how is it pocket friendly? ????", "@ZukuOfficial 574766 ur customer service says it's meant for Dormant accounts.y is it then on media as pocket friendly per month?", "@Zuku_WeCare @ZukuOfficial  six hours later and my connection is limited.", "@ZukuOfficial 114139 the internet isnt working. Fluctuated a little yesterday as well.what is the problem?", "@Zuku_WeCare @ZukuOfficial 72 hrs later, no internet issue still unresolved a/c no. 89433. @consumerkenya", "RT @KipngenoK: #FollowFriday @ZukuOfficial @SSReaney @wanjirumbugua1 top Influencers this week! Have a great weekend :) &gt;&gt; https://t.co/9Ru…", "@ZukuOfficial my account number is 106361", "#FollowFriday @ZukuOfficial @SSReaney @wanjirumbugua1 top Influencers this week! Have a great weekend :) &gt;&gt; https://t.co/9Ru94ZKout", "@ZukuOfficial @Zuku_WeCare you guys I send you an email you sit on it only to reply days later making demands you literrally annoy", "@chichykeym @ZukuOfficial @Zuku_WeCare Its time we talk to a competitor! It's becoming a joke now!", "@ZukuOfficial  its too slow and always especially in the evening,I try to open it say no network! Even downloading a simple things", "@ZukuOfficial zuku is frustrating yet I pay on time  Plse don't be fast to remind me payment is due bt fail to give value for money. 120001", "@ZukuOfficial Now, can you DM the contacts for that guy. I have a journey to take in the next 30 minutes", "@ZukuOfficial But this information was never conveyed to me.", "Hello @ZukuOfficial , We have paid for A/C 304518 for a downgrade to Classic as previously agreed. Kindly update. Thank you", "@ZukuOfficial Ever since I made payment for A/C 196406 I've not been connected and your agent that I dealt with keeps on lying to me", "@ZukuOfficial obviously. Cause your bloody router is busted and you have refused to replace it. Tell me something I don't know for a change.", "@ZukuOfficial Mko na mchezo sana siku hizi", "@ZukuOfficial Account 115983 I have several issues I want sort out. Had spoken to an agent, kindly would you call me back for followup", "Hey @ZukuOfficial can you beat my high score? https://t.co/WRV4rnGV8A", "Hatukumalizana pale DM @ZukuOfficial", "@ZukuOfficial its back now thanks", "@jane_kebenei @zuku_wecare @zukuofficial Surely I cant be complaining about the same thing everyday. 132403 no internet.", "@ZukuOfficial the signal is back, data is ok but tv is sticky with freezing video frames..I need better service", "@ZukuOfficial when will you connect residents of Karen specifically Miotoni area? It's been a year since you promised to do so", "@ZukuOfficial sawa", "@ZukuOfficial my WiFi is still down. Did you get my DMs?", "@ZukuOfficial Hey made payment.. kindly change for me the package...", "@ZukuOfficial its been like this was told problem is being fixed..if so plz let me pay for the low Mbps av been getting", "@ZukuOfficial https://t.co/j55ffs4QCx", "@ZukuOfficial @Namdee4 126541", "@ZukuOfficial my Mbps are supposed to be 15mbps and am not getting that .I can't pay for what am not getting https://t.co/eT4OZ0F7ih", "@ZukuOfficial Your days are numbered. Your support service offerings will change one day, or be forced to change.", "@ZukuOfficial been getting very low speed ,and expected to pay full amount can I get revised billing.please my Mbps are very low", "@Zuku_WeCare @ZukuOfficial as early as 6 am to 11 am the connection becomes limited and at around 4 pm to 6 pm. It's a habit!!!!", "@Zuku_WeCare @ZukuOfficial yet here I am again with a limited connection. Why is this always happening?", "@ZukuOfficial: bought a package with you on 24th April. It's May 6. Still not connected in jacaranda   #unacceptable.", "@ZukuOfficial @ndongystyle I agree Zuku WIFI has been unstable for the past one week and continues being so!", "@ZukuOfficial the problwm is, my connection is up 5mins and down 10mins, am not entirely satisfied this is sorted out, thing keeps tripping.", "@ZukuOfficial no connectivity yet!!!!!", "@ZukuOfficial its now back....thx", "@ZukuOfficial like I said. It goes on and off. I wouldn't be reporting this just for kicks. It has been unstable  past week", "@ZukuOfficial Respond to dm", "@nbstv @SolomonSerwanjj @nyamadon...strange i get all channels except @nbstv. @ZukuOfficial", "@ZukuOfficial my link is back. Thank you and good day", "@ZukuOfficial Hi. My link is down again. Please help", "@ZukuOfficial your technicians were here yesterday. Internet STILL offline again this morning. Thought they resolved the problem?", "@ZukuOfficial the ac number is 142269 kindly check these speed is becoming a frustration.", "@ZukuOfficial sawasawa, will do", "@ZukuOfficial yes\nThats because i tried to switch off rhe router n power it back on", "@syl_vestr I feel you @ZukuOfficial they always have excuses. The best thing ni kuhama", "You'd think the internet speeds would be faster at this time! Way too slow! @ZukuOfficial", "@ZukuOfficial\nHi..your team came and sorted out the issue. Thanks for the support.\nRegards", "@solomonkababu @ferozdeprinces @homeboyzradio @talliaoyando #UPTOWNNIGHTS Iko clear @ZukuOfficial", "@ZukuOfficial there's still an issue with the internet and tv", "RT @evangelinechao: So my relationship with @ZukuOfficial is off to a very great start. I am hoping that this is not just the honeymoon pha…", "@ZukuOfficial @Jane_Kebenei Thanks. Please note, we are in the same estate, package and service outage...", "@ZukuOfficial cant see the wireless name", "@EdgarbrwnBrwn @HomeboyzRadio @SolomonKababu @talliaoyando @ZukuOfficial ooh I gatch  you@BamBa", "RT @EbruTVKenya: Don't feel left out get us on channel 17 @ZukuOfficial ,109 @StarTimesKenya and 96 @GOtvKenya #CafeNgoma https://t.co/BT2h…", "@ferozdeprinces @homeboyzradio @solomonkababu @talliaoyando @ferozdeprinces iko Kwa @ZukuOfficial @Bamba  #UptownNights", "Don't feel left out get us on channel 17 @ZukuOfficial ,109 @StarTimesKenya and 96 @GOtvKenya #CafeNgoma https://t.co/BT2hrJ0Fcf", "@ZukuOfficial hi. There isn't TV showing. The screen is blank but internet OK....what could be wrong. Acc: 069770.", "@ZukuOfficial @Zuku_WeCare Is your unresponsiveness a result of inability or unwillingness to assist ? https://t.co/UD22Bn23gk", "@ZukuOfficial Situation in our court n you send a guy who when confronted can't produce his job card. @Zuku_WeCare https://t.co/oVxEtORS1Q", "@ZukuOfficial please help net is slow and am streaming football 174848", "on top of all equipment, am privileged to have installed WiFi in my house , thanks to @ZukuOfficial", "@ZukuOfficial Hi. Currently doing 5.5 and 1.37. Kindly check and revert.", "@Zuku_WeCare @ZukuOfficial 184776", "@ZukuOfficial this has always been the cycle.... I posted pics of the speed test....", "@ZukuOfficial your services always fails when i need it most &amp; i wonder why am paying for the 30mbps. Kindly advice how i can get refund", "@ZukuOfficial Need. Router. Replaced.", "@ZukuOfficial every day I wonder more and more what I'm paying you for. You're the most unreliable service provider on Earth.", "@ZukuOfficial yeah i tested am still getting 1.26mbps", "@ZukuOfficial @Zuku_WeCare despite your text, no internet yet power is back\nplease reset my a/c 149809 to enable browsing", "@ZukuOfficial please guys, fix my net. I mean, can't a niggah stream his porn in peace!😩😒 ( jk✌jk✌) Seriously though, fix it. 150689", "Niwaulize @ZukuOfficial ni downtime ama iko nini? Internet too slow a/c 183060", "@ZukuOfficial MA yeah. Its very okay now. Thank you", "@ZukuOfficial it still happens please fix. Thanks", "@ZukuOfficial what is up with the lies, since 50 percent upgrade i have never had speed above 4.8mbps!!!", "@ZukuOfficial yes it is. Thank you.", "@ZukuOfficial could I kindly have a stable connection.", "@ZukuOfficial @Jane_Kebenei Thanks &amp; noted. Pole abt the missed calls. BTW some1 got 50% discount for service interruption &amp; we got 13%?? 🤔", "@ZukuOfficial @Zuku_WeCare ......connections downs for hours.....", "@ZukuOfficial @Zuku_WeCare .....connection at my end for hours....is there something I should know?", "@ZukuOfficial @Zuku_WeCare no network. Help 115888", "@ZukuOfficial no its not. Kindly reset", "@ZukuOfficial fix my tv and Internet connection Account 85714", "@ZukuOfficial These few months remaining that y'all have clients,si mufanye tu kazi vizuri. As in you only have one job. Ac 155288", "@Zuku_WeCare @ZukuOfficial thats how pathetic it is.... Am sure you are familiar with this site https://t.co/cV9d39wbRf", "@Zuku_WeCare @ZukuOfficial I see no reason for paying another month... I've been patient with you for long.... #amdone", "@ZukuOfficial @Zuku_WeCare one of your posts is down in buruburu phase 2 kikambuoni court...service available but post has blocked entrance", "@ZukuOfficial Acc 124255 is down. Fix asap", "@ZukuOfficial @Zuku_WeCare just had enough of this.... For two weeks internet has been pathetic!! Thanks to @AIRTEL_KE still got internet", "It has only rained for 5mins and we've lost connection already!!! Reconnect a/c 146446! @Zuku_WeCare @ZukuOfficial", "@ZukuOfficial what is the progress on the shifting request? 178527", "@ZukuOfficial @Zuku_WeCare Power is back please reset my account 178904 to enable browsing", "@ZukuOfficial hi plz follow i wd like to dm you. thanks.", "@ZukuOfficial please fix citizen tv the sound ain't matching with what they are saying it's annoying", "@Zuku_WeCare @ZukuOfficial whats up with net in madaraka its painfully slow... account number 174172....", "@ZukuOfficial please check DM", "RT @shaydest: @dmuraguri @ZukuOfficial @tujak @DKaringithi My high score is 2790. Wouldn't have gotten there without no net obviously. Than…", "RT @dmuraguri: Thank you @ZukuOfficial for introducing me to the joys of the Running T-Rex cc @shaydest @tujak @DKaringithi https://t.co/zP…", "@ZukuOfficial @Zuku_WeCare What's been up with the Internet speeds in highrise. speeds of 1.8mbs for a 15mbps subscription. Fix this!", "Hey @Zuku_WeCare @ZukuOfficial my net is down ac 62253... Kindly assist", "@dmuraguri @ZukuOfficial @tujak @DKaringithi My high score is 2790. Wouldn't have gotten there without no net obviously. Thanks Zuku.", "Thank you @ZukuOfficial for introducing me to the joys of the Running T-Rex cc @shaydest @tujak @DKaringithi https://t.co/zPFqmQqiGL", "RT @BCbanxx: Step aside @ZukuOfficial...&gt; Able Wireless Goes Live in Kenya With Kshs 500 Home Internet and TV for the Masses. https://t.co/…", "@ZukuOfficial 0738702007, fredrickwamudete@gmail.com , ffredricks1a@gmail.com"]